[Timeout] TrueValue
Config/Database.php:13:5
     private $password;
     private $database;
 
-    public function __construct(bool $useEnv = true) {
+    public function __construct(bool $useEnv = false)
         if (!$useEnv) {
             $this->setDefaultCredentials();

[Killed] LogicalNot
Config/Database.php:14:9
     private $database;
 
     public function __construct(bool $useEnv = true) {
-        if (!$useEnv) {
+        if ($useEnv) {
             $this->setDefaultCredentials();
             return;
killedBy: Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
fopen(C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\.env): Failed to open stream: Permission denied

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\vendor\infection\include-interceptor\src\IncludeInterceptor.php:113
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-report

[Killed] MethodCallRemoval
Config/Database.php:15:13
 
     public function __construct(bool $useEnv = true) {
         if (!$useEnv) {
-            $this->setDefaultCredentials();
+            
             return;
         }
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_constructor_usa_env_cuando_existe
Failed asserting that null matches expected 'test_host'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Config\DatabaseTest.php:36

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Ternary
Config/Database.php:37:9
 
     private function setDefaultCredentials(): void
     {
-        $this->host = getenv('DB_HOST') ?: 'db';
+        $this->host = getenv('DB_HOST') ? 'db' : getenv('DB_HOST');
         $this->user = getenv('DB_USER') ?: 'root';
         $this->password = getenv('DB_PASSWORD') ?: '123456';
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_constructor_usa_env_cuando_existe
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'test_host'
+'db'

[Killed] Ternary
Config/Database.php:38:9
     private function setDefaultCredentials(): void
     {
         $this->host = getenv('DB_HOST') ?: 'db';
-        $this->user = getenv('DB_USER') ?: 'root';
+        $this->user = getenv('DB_USER') ? 'root' : getenv('DB_USER');
         $this->password = getenv('DB_PASSWORD') ?: '123456';
         $this->database = getenv('DB_NAME') ?: 'tienda_bd';
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_constructor_usa_valores_por_defecto_cuando_no_hay_env
Failed asserting that false matches expected 'root'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Config\DatabaseTest.php:58

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Timeout] Ternary
Config/Database.php:39:9
     {
         $this->host = getenv('DB_HOST') ?: 'db';
         $this->user = getenv('DB_USER') ?: 'root';
-        $this->password = getenv('DB_PASSWORD') ?: '123456';
+        $this->password = getenv('DB_PASSWORD') ? '123456' : getenv('DB_PASSWORD');
         $this->database = getenv('DB_NAME') ?: 'tienda_bd';
     }

[Timeout] Ternary
Config/Database.php:40:9
         $this->host = getenv('DB_HOST') ?: 'db';
         $this->user = getenv('DB_USER') ?: 'root';
         $this->password = getenv('DB_PASSWORD') ?: '123456';
-        $this->database = getenv('DB_NAME') ?: 'tienda_bd';
+        $this->database = getenv('DB_NAME') ? 'tienda_bd' : getenv('DB_NAME');
     }
 

[Killed] PublicVisibility
Config/Database.php:51:5
         $this->database = $database;
     }
 
-    public function connect() {
+    protected function connect()
         try {
             $conn = new \PDO(
killedBy: Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
Failed asserting that exception of type "Error" matches expected exception "Exceptions\DatabaseException". Message was: "Call to protected method Config\Database::connect() from scope Tests\Unit\Config\DatabaseTest" at
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Config\DatabaseTest.ph

[Timeout] ConcatOperandRemoval
Config/Database.php:62:13
             $conn->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
             return $conn;
         } catch(\PDOException $e) {
-            error_log("Error de conexión: " . $e->getMessage());
+            error_log("Error de conexión: ");
             throw new DatabaseException(
                 "Error de conexión a la base de datos: " . $e->getMessage(),

[Timeout] FunctionCallRemoval
Config/Database.php:62:13
             $conn->setAttribute(\PDO::ATTR_ERRMODE, \PDO::ERRMODE_EXCEPTION);
             return $conn;
         } catch(\PDOException $e) {
-            error_log("Error de conexión: " . $e->getMessage());
+            
             throw new DatabaseException(
                 "Error de conexión a la base de datos: " . $e->getMessage(),

[Killed] Throw_
Config/Database.php:63:13
             return $conn;
         } catch(\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
-            throw new DatabaseException(
-                "Error de conexión a la base de datos: " . $e->getMessage(),
-                $e->getCode(),
-                $e
-            );
+            new DatabaseException("Error de conexión a la base de datos: " . $e->getMessage(), $e->getCode(), $e);
         }
     }
killedBy: Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
statusReason: 1) Tests\Unit\Config\DatabaseTest::test_conexion_fallida_lanza_excepcion
Failed asserting that exception of type "Exceptions\DatabaseException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Timeout] ConcatOperandRemoval
Config/Database.php:64:17
         } catch(\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
             throw new DatabaseException(
-                "Error de conexión a la base de datos: " . $e->getMessage(),
+                throw new DatabaseException("Error de conexión a la base de datos: ", $e->getCode(), $e);
                 $e->getCode(),
                 $e

[Timeout] Concat
Config/Database.php:64:17
         } catch(\PDOException $e) {
             error_log("Error de conexión: " . $e->getMessage());
             throw new DatabaseException(
-                "Error de conexión a la base de datos: " . $e->getMessage(),
+                throw new DatabaseException($e->getMessage() . "Error de conexión a la base de datos: ", $e->getCode(), $e);
                 $e->getCode(),
                 $e
