[Killed] PublicVisibility
Controllers/AdminController.php:20:5
         $this->conn = $conn;
     }
 
-    public function getDashboardData() {
+    protected function getDashboardData()
         $data = [];
         
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetDashboardData
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetDashboardData
Error: Call to protected method Controllers\AdminController::getDashboardData() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:37

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:38:9
 
     private function getTotalPendings() {
         $stmt = $this->conn->prepare("SELECT * FROM `orders` WHERE payment_status = 'pendiente'");
-        $stmt->execute();
+        
         $total = 0;
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {

[Killed] DecrementInteger
Controllers/AdminController.php:39:9
     private function getTotalPendings() {
         $stmt = $this->conn->prepare("SELECT * FROM `orders` WHERE payment_status = 'pendiente'");
         $stmt->execute();
-        $total = 0;
+        $total = -1;
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $order = new Order();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
Failed asserting that 249.0 matches expected 250.0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:316

FAILURES!
Tests: 14, Assertions: 36, Failures: 1.

[Killed] Foreach_
Controllers/AdminController.php:40:9
         $stmt = $this->conn->prepare("SELECT * FROM `orders` WHERE payment_status = 'pendiente'");
         $stmt->execute();
         $total = 0;
-        foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-            $order = new Order();
-            $order->setId($row['id']);
-            $order->setTotalPrice($row['total_price']);
-            $total += $order->getTotalPrice();
-        }
+        foreach (array() as $row) {
         return $total;
     }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
Failed asserting that 0 matches expected 250.0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:316

FAILURES!
Tests: 14, Assertions: 36, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:42:13
         $total = 0;
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $order = new Order();
-            $order->setId($row['id']);
+            
             $order->setTotalPrice($row['total_price']);
             $total += $order->getTotalPrice();

[Killed] MethodCallRemoval
Controllers/AdminController.php:43:13
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $order = new Order();
             $order->setId($row['id']);
-            $order->setTotalPrice($row['total_price']);
+            
             $total += $order->getTotalPrice();
         }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
Failed asserting that 0 matches expected 250.0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:316

FAILURES!
Tests: 14, Assertions: 36, Failures: 1.

[Killed] Assignment
Controllers/AdminController.php:44:13
             $order = new Order();
             $order->setId($row['id']);
             $order->setTotalPrice($row['total_price']);
-            $total += $order->getTotalPrice();
+            $total = $order->getTotalPrice();
         }
         return $total;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
Failed asserting that 150.0 matches expected 250.0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:316

FAILURES!
Tests: 14, Assertions: 36, Failures: 1.

[Killed] PlusEqual
Controllers/AdminController.php:44:13
             $order = new Order();
             $order->setId($row['id']);
             $order->setTotalPrice($row['total_price']);
-            $total += $order->getTotalPrice();
+            $total -= $order->getTotalPrice();
         }
         return $total;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetTotalPendings
Failed asserting that -250.0 matches expected 250.0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:316

FAILURES!
Tests: 14, Assertions: 36, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:51:9
 
     private function getTotalCompleted() {
         $stmt = $this->conn->prepare("SELECT * FROM `orders` WHERE payment_status = 'completado'");
-        $stmt->execute();
+        
         $total = 0;
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {

[Survived] MethodCallRemoval
Controllers/AdminController.php:65:9
     private function getOrdersCount() {
         $query = "SELECT COUNT(*) as count FROM `orders`";
         $stmt = $this->conn->prepare($query);
-        $stmt->execute();
+        
         return $stmt->fetch(\PDO::FETCH_ASSOC)['count'];
     }

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:105:9
     }
 
     private function handleDatabaseError($e) {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log($e->getMessage());
         throw new \Exception("Error al procesar la solicitud");
     }

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:105:9
     }
 
     private function handleDatabaseError($e) {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log("Error en la base de datos: ");
         throw new \Exception("Error al procesar la solicitud");
     }

[Killed] Throw_
Controllers/AdminController.php:106:9
 
     private function handleDatabaseError($e) {
         error_log("Error en la base de datos: " . $e->getMessage());
-        throw new \Exception("Error al procesar la solicitud");
+        new \Exception("Error al procesar la solicitud");
     }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testHandleDatabaseError
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testHandleDatabaseError
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 13, Assertions: 34, Failures: 1.

[Killed] PublicVisibility
Controllers/AdminController.php:109:5
         throw new \Exception("Error al procesar la solicitud");
     }
 
-    public function addProduct($postData, $files) {
+    protected function addProduct($postData, $files)
         try {
             $product = new Product();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

ERRORS!
Tests: 3, Assertions: 5, Errors: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:112:13
     public function addProduct($postData, $files) {
         try {
             $product = new Product();
-            $product->setName($postData['name']);
+            
             $product->setPrice($postData['price']);
             $product->setImage($files['image']['name']);
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:113:13
         try {
             $product = new Product();
             $product->setName($postData['name']);
-            $product->setPrice($postData['price']);
+            
             $product->setImage($files['image']['name']);
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:114:13
             $product = new Product();
             $product->setName($postData['name']);
             $product->setPrice($postData['price']);
-            $product->setImage($files['image']['name']);
+            
 
             // Verificar si el producto ya existe
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:118:13
 
             // Verificar si el producto ya existe
             $stmt = $this->conn->prepare("SELECT name FROM `products` WHERE name = ?");
-            $stmt->execute([$product->getName()]);
+            
             
             if($stmt->rowCount() > 0) {
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] GreaterThanNegotiation
Controllers/AdminController.php:120:13
             $stmt = $this->conn->prepare("SELECT name FROM `products` WHERE name = ?");
             $stmt->execute([$product->getName()]);
             
-            if($stmt->rowCount() > 0) {
+            if ($stmt->rowCount() <= 0) {
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:68

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] GreaterThan
Controllers/AdminController.php:120:13
             $stmt = $this->conn->prepare("SELECT name FROM `products` WHERE name = ?");
             $stmt->execute([$product->getName()]);
             
-            if($stmt->rowCount() > 0) {
+            if ($stmt->rowCount() >= 0) {
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:68

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:121:17
             $stmt->execute([$product->getName()]);
             
             if($stmt->rowCount() > 0) {
-                return ['success' => false, 'message' => 'El producto ya existe'];
+                return ['success' => true, 'message' => 'El producto ya existe'];
             }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductWithExistingName
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductWithExistingName
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:573

FAILURES!
Tests: 28, Assertions: 53, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/AdminController.php:121:17
             $stmt->execute([$product->getName()]);
             
             if($stmt->rowCount() > 0) {
-                return ['success' => false, 'message' => 'El producto ya existe'];
+                return ['message' => 'El producto ya existe'];
             }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductWithExistingName
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductWithExistingName
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:573

ERRORS!
Tests: 28, Assertions: 52, Errors: 1.

[Killed] GreaterThan
Controllers/AdminController.php:124:13
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
 
-            if($files['image']['size'] > 2000000) {
+            if ($files['image']['size'] >= 2000000) {
                 return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] GreaterThanNegotiation
Controllers/AdminController.php:124:13
                 return ['success' => false, 'message' => 'El producto ya existe'];
             }
 
-            if($files['image']['size'] > 2000000) {
+            if ($files['image']['size'] <= 2000000) {
                 return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:68

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:125:17
             }
 
             if($files['image']['size'] > 2000000) {
-                return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
+                return ['success' => true, 'message' => 'El tamaño de la imagen es demasiado grande'];
             }
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 1, Assertions: 0, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:130:17
 
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");
             if($stmt->execute([$product->getName(), $product->getPrice(), $product->getImage()])) {
-                move_uploaded_file($files['image']['tmp_name'], self::UPLOAD_PATH . $product->getImage());
+                move_uploaded_file($files['image']['tmp_name'], self::UPLOAD_PATH);
                 return ['success' => true, 'message' => '¡Producto añadido exitosamente!'];
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:130:17
 
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");
             if($stmt->execute([$product->getName(), $product->getPrice(), $product->getImage()])) {
-                move_uploaded_file($files['image']['tmp_name'], self::UPLOAD_PATH . $product->getImage());
+                move_uploaded_file($files['image']['tmp_name'], $product->getImage());
                 return ['success' => true, 'message' => '¡Producto añadido exitosamente!'];
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] TrueValue
Controllers/AdminController.php:131:17
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");
             if($stmt->execute([$product->getName(), $product->getPrice(), $product->getImage()])) {
                 move_uploaded_file($files['image']['tmp_name'], self::UPLOAD_PATH . $product->getImage());
-                return ['success' => true, 'message' => '¡Producto añadido exitosamente!'];
+                return ['success' => false, 'message' => '¡Producto añadido exitosamente!'];
             }
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:68

FAILURES!
Tests: 3, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] ArrayItemRemoval
Controllers/AdminController.php:131:17
             $stmt = $this->conn->prepare("INSERT INTO `products`(name, price, image) VALUES(?, ?, ?)");
             if($stmt->execute([$product->getName(), $product->getPrice(), $product->getImage()])) {
                 move_uploaded_file($files['image']['tmp_name'], self::UPLOAD_PATH . $product->getImage());
-                return ['success' => true, 'message' => '¡Producto añadido exitosamente!'];
+                return ['message' => '¡Producto añadido exitosamente!'];
             }
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

ERRORS!
Tests: 3, Assertions: 5, Errors: 1, Warnings: 1.

[Killed] PublicVisibility
Controllers/AdminController.php:139:5
         }
     }
 
-    public function deleteProduct($id) {
+    protected function deleteProduct($id)
         try {
             // Obtener información de la imagen
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteProduct
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

ERRORS!
Tests: 6, Assertions: 14, Errors: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:143:13
         try {
             // Obtener información de la imagen
             $stmt = $this->conn->prepare("SELECT image FROM `products` WHERE id = ?");
-            $stmt->execute([$id]);
+            
             $image_data = $stmt->fetch(\PDO::FETCH_ASSOC);
             
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ArrayItemRemoval
Controllers/AdminController.php:143:13
         try {
             // Obtener información de la imagen
             $stmt = $this->conn->prepare("SELECT image FROM `products` WHERE id = ?");
-            $stmt->execute([$id]);
+            $stmt->execute([]);
             $image_data = $stmt->fetch(\PDO::FETCH_ASSOC);
             
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:147:17
             $image_data = $stmt->fetch(\PDO::FETCH_ASSOC);
             
             if($image_data) {
-                $imagePath = self::UPLOAD_PATH . $image_data['image'];
+                $imagePath = $image_data['image'];
                 if(file_exists($imagePath)) {
                     unlink($imagePath);
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] Concat
Controllers/AdminController.php:147:17
             $image_data = $stmt->fetch(\PDO::FETCH_ASSOC);
             
             if($image_data) {
-                $imagePath = self::UPLOAD_PATH . $image_data['image'];
+                $imagePath = $image_data['image'] . self::UPLOAD_PATH;
                 if(file_exists($imagePath)) {
                     unlink($imagePath);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteProduct
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testDeleteProduct
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:129

FAILURES!
Tests: 6, Assertions: 15, Failures: 1, Warnings: 1.

[Killed] TrueValue
Controllers/AdminController.php:155:17
             
             $stmt = $this->conn->prepare("DELETE FROM `products` WHERE id = ?");
             if($stmt->execute([$id])) {
-                return ['success' => true, 'message' => 'Producto eliminado'];
+                return ['success' => false, 'message' => 'Producto eliminado'];
             }
             
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteProduct
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testDeleteProduct
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:129

FAILURES!
Tests: 6, Assertions: 15, Failures: 1, Warnings: 1.

[Killed] LogicalNot
Controllers/AdminController.php:172:13
     private function getSecureImagePath($imageName) {
         try {
             // Validar el nombre del archivo
-            if (empty($imageName) || !is_string($imageName)) {
+            if (empty($imageName) || is_string($imageName)) {
                 throw new \Exception('Nombre de archivo inválido');
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
Failed asserting that false is not false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:503

FAILURES!
Tests: 24, Assertions: 48, Failures: 1.

[Survived] LogicalOr
Controllers/AdminController.php:172:13
     private function getSecureImagePath($imageName) {
         try {
             // Validar el nombre del archivo
-            if (empty($imageName) || !is_string($imageName)) {
+            if (empty($imageName) && !is_string($imageName)) {
                 throw new \Exception('Nombre de archivo inválido');
             }

[Survived] UnwrapStrToLower
Controllers/AdminController.php:177:13
             }
 
             // Obtener y validar la extensión
-            $extension = strtolower(pathinfo($imageName, PATHINFO_EXTENSION));
+            $extension = pathinfo($imageName, PATHINFO_EXTENSION);
             if (!in_array($extension, self::ALLOWED_EXTENSIONS)) {
                 throw new \Exception('Tipo de archivo no permitido');

[Killed] LogicalNot
Controllers/AdminController.php:178:13
 
             // Obtener y validar la extensión
             $extension = strtolower(pathinfo($imageName, PATHINFO_EXTENSION));
-            if (!in_array($extension, self::ALLOWED_EXTENSIONS)) {
+            if (in_array($extension, self::ALLOWED_EXTENSIONS)) {
                 throw new \Exception('Tipo de archivo no permitido');
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
Failed asserting that false is not false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:503

FAILURES!
Tests: 24, Assertions: 48, Failures: 1.

[Killed] Throw_
Controllers/AdminController.php:179:17
             // Obtener y validar la extensión
             $extension = strtolower(pathinfo($imageName, PATHINFO_EXTENSION));
             if (!in_array($extension, self::ALLOWED_EXTENSIONS)) {
-                throw new \Exception('Tipo de archivo no permitido');
+                new \Exception('Tipo de archivo no permitido');
             }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePathInvalidExtension
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePathInvalidExtension
Error: Call to a member function execute() on bool

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:173
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:516

ERRORS!
Tests: 25,

[Survived] MethodCallRemoval
Controllers/AdminController.php:184:13
 
             // Verificar que el archivo existe en la base de datos
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ?");
-            $stmt->execute([$imageName]);
+            
             if (!$stmt->fetch()) {
                 throw new \Exception('Archivo no encontrado en la base de datos');

[Killed] LogicalNot
Controllers/AdminController.php:185:13
             // Verificar que el archivo existe en la base de datos
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ?");
             $stmt->execute([$imageName]);
-            if (!$stmt->fetch()) {
+            if ($stmt->fetch()) {
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
Failed asserting that false is not false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:503

FAILURES!
Tests: 24, Assertions: 48, Failures: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:189:13
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }
 
-            return self::UPLOAD_PATH . $imageName;
+            return self::UPLOAD_PATH;
         } catch (\Exception $e) {
             error_log("Error en getSecureImagePath: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePath
Failed asserting that '../../uploaded_img/' contains "test.jpg".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:504

FAILURES!
Tests: 24, Assertions: 49, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:189:13
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }
 
-            return self::UPLOAD_PATH . $imageName;
+            return $imageName;
         } catch (\Exception $e) {
             error_log("Error en getSecureImagePath: " . $e->getMessage());

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:191:13
 
             return self::UPLOAD_PATH . $imageName;
         } catch (\Exception $e) {
-            error_log("Error en getSecureImagePath: " . $e->getMessage());
+            error_log("Error en getSecureImagePath: ");
             return false;
         }

[Survived] ConcatOperandRemoval
Controllers/AdminController.php:191:13
 
             return self::UPLOAD_PATH . $imageName;
         } catch (\Exception $e) {
-            error_log("Error en getSecureImagePath: " . $e->getMessage());
+            error_log($e->getMessage());
             return false;
         }

[Killed] FalseValue
Controllers/AdminController.php:192:13
             return self::UPLOAD_PATH . $imageName;
         } catch (\Exception $e) {
             error_log("Error en getSecureImagePath: " . $e->getMessage());
-            return false;
+            return true;
         }
     }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePathInvalidExtension
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetSecureImagePathInvalidExtension
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:518

FAILURES!
Tests: 25, Assertions: 50, Failures: 1.

[Killed] FalseValue
Controllers/AdminController.php:200:17
         try {
             // Validar el nombre del archivo
             if (empty($imageName) || !is_string($imageName)) {
-                return false;
+                return true;
             }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testHandleImageDeleteInvalidName
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testHandleImageDeleteInvalidName
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:548

FAILURES!
Tests: 27, Assertions: 52, Failures: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:205:13
 
             // Verificar en la base de datos
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ? LIMIT 1");
-            $stmt->execute([$imageName]);
+            
             $result = $stmt->fetch(\PDO::FETCH_ASSOC);
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] LogicalNot
Controllers/AdminController.php:208:13
             $stmt->execute([$imageName]);
             $result = $stmt->fetch(\PDO::FETCH_ASSOC);
 
-            if (!$result) {
+            if ($result) {
                 return false;
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.
