[Survived] FalseValue
Controllers/AdminController.php:209:17
             $result = $stmt->fetch(\PDO::FETCH_ASSOC);
 
             if (!$result) {
-                return false;
+                return true;
             }
 

[Killed] Concat
Controllers/AdminController.php:213:13
             }
 
             // Construir y validar la ruta
-            $fullPath = realpath(self::UPLOAD_PATH . $result['image']);
+            $fullPath = realpath($result['image'] . self::UPLOAD_PATH);
             $uploadDir = realpath(self::UPLOAD_PATH);
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:213:13
             }
 
             // Construir y validar la ruta
-            $fullPath = realpath(self::UPLOAD_PATH . $result['image']);
+            $fullPath = realpath(self::UPLOAD_PATH);
             $uploadDir = realpath(self::UPLOAD_PATH);
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:217:13
             $uploadDir = realpath(self::UPLOAD_PATH);
 
             // Verificar que el archivo está dentro del directorio permitido
-            if ($fullPath === false || strpos($fullPath, $uploadDir) !== 0) {
+            if ($fullPath === true || strpos($fullPath, $uploadDir) !== 0) {
                 return false;
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] NotIdentical
Controllers/AdminController.php:217:13
             $uploadDir = realpath(self::UPLOAD_PATH);
 
             // Verificar que el archivo está dentro del directorio permitido
-            if ($fullPath === false || strpos($fullPath, $uploadDir) !== 0) {
+            if ($fullPath === false || strpos($fullPath, $uploadDir) === 0) {
                 return false;
             }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:218:17
 
             // Verificar que el archivo está dentro del directorio permitido
             if ($fullPath === false || strpos($fullPath, $uploadDir) !== 0) {
-                return false;
+                return true;
             }
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] PublicVisibility
Controllers/AdminController.php:233:5
         }
     }
 
-    public function updateProduct($postData, $files) {
+    protected function updateProduct($postData, $files)
         try {
             $product = new Product();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProduct
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

ERRORS!
Tests: 12, Assertions: 27, Errors: 1, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:236:13
     public function updateProduct($postData, $files) {
         try {
             $product = new Product();
-            $product->setId($postData['update_p_id']);
+            
             $product->setName($postData['update_name']);
             $product->setPrice($postData['update_price']);
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:237:13
         try {
             $product = new Product();
             $product->setId($postData['update_p_id']);
-            $product->setName($postData['update_name']);
+            
             $product->setPrice($postData['update_price']);
             
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:238:13
             $product = new Product();
             $product->setId($postData['update_p_id']);
             $product->setName($postData['update_name']);
-            $product->setPrice($postData['update_price']);
+            
             
             if(!empty($files['update_image']['name'])) {
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] LogicalNot
Controllers/AdminController.php:240:13
             $product->setName($postData['update_name']);
             $product->setPrice($postData['update_price']);
             
-            if(!empty($files['update_image']['name'])) {
+            if (empty($files['update_image']['name'])) {
                 if($files['update_image']['size'] > 2000000) {
                     return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithoutImage
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithoutImage
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:462

FAILURES!
Tests: 23, Assertions: 44, Failures: 1, Warnings: 1.

[Killed] GreaterThanNegotiation
Controllers/AdminController.php:241:17
             $product->setPrice($postData['update_price']);
             
             if(!empty($files['update_image']['name'])) {
-                if($files['update_image']['size'] > 2000000) {
+                if ($files['update_image']['size'] <= 2000000) {
                     return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
                 }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProduct
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProduct
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:243

FAILURES!
Tests: 12, Assertions: 28, Failures: 1, Warnings: 1.

[Killed] GreaterThan
Controllers/AdminController.php:241:17
             $product->setPrice($postData['update_price']);
             
             if(!empty($files['update_image']['name'])) {
-                if($files['update_image']['size'] > 2000000) {
+                if ($files['update_image']['size'] >= 2000000) {
                     return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
                 }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:242:21
             
             if(!empty($files['update_image']['name'])) {
                 if($files['update_image']['size'] > 2000000) {
-                    return ['success' => false, 'message' => 'El tamaño de la imagen es demasiado grande'];
+                    return ['success' => true, 'message' => 'El tamaño de la imagen es demasiado grande'];
                 }
 
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithLargeImage
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProductWithLargeImage
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:484

FAILURES!
Tests: 23, Assertions: 46, Failures: 1.

[Killed] LogicalNot
Controllers/AdminController.php:246:17
                 }
 
                 // Eliminar imagen anterior de forma segura
-                if (!empty($postData['update_old_image'])) {
+                if (empty($postData['update_old_image'])) {
                     $this->handleImageDelete($postData['update_old_image']);
                 }
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:247:21
 
                 // Eliminar imagen anterior de forma segura
                 if (!empty($postData['update_old_image'])) {
-                    $this->handleImageDelete($postData['update_old_image']);
+                    
                 }
 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] UnwrapStrToLower
Controllers/AdminController.php:251:17
                 }
 
                 // Generar nombre único para la nueva imagen
-                $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
+                $extension = pathinfo($files['update_image']['name'], PATHINFO_EXTENSION);
                 $newImageName = uniqid() . '.' . $extension;
                 $product->setImage($newImageName);
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] Concat
Controllers/AdminController.php:252:17
 
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
-                $newImageName = uniqid() . '.' . $extension;
+                $newImageName = '.' . uniqid() . $extension;
                 $product->setImage($newImageName);
                 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:252:17
 
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
-                $newImageName = uniqid() . '.' . $extension;
+                $newImageName = '.' . $extension;
                 $product->setImage($newImageName);
                 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:253:17
                 // Generar nombre único para la nueva imagen
                 $extension = strtolower(pathinfo($files['update_image']['name'], PATHINFO_EXTENSION));
                 $newImageName = uniqid() . '.' . $extension;
-                $product->setImage($newImageName);
+                
                 
                 // Subir nueva imagen
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] FunctionCallRemoval
Controllers/AdminController.php:256:17
                 $product->setImage($newImageName);
                 
                 // Subir nueva imagen
-                move_uploaded_file(
-                    $files['update_image']['tmp_name'], 
-                    self::UPLOAD_PATH . $newImageName
-                );
+                
                 
                 $stmt = $this->conn->prepare("UPDATE `products` SET name = ?, price = ?, image = ? WHERE id = ?");
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:258:21
                 // Subir nueva imagen
                 move_uploaded_file(
                     $files['update_image']['tmp_name'], 
-                    self::UPLOAD_PATH . $newImageName
+                    move_uploaded_file($files['update_image']['tmp_name'], $newImageName);
                 );
                 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] ConcatOperandRemoval
Controllers/AdminController.php:258:21
                 // Subir nueva imagen
                 move_uploaded_file(
                     $files['update_image']['tmp_name'], 
-                    self::UPLOAD_PATH . $newImageName
+                    move_uploaded_file($files['update_image']['tmp_name'], self::UPLOAD_PATH);
                 );
                 
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

WARNINGS!
Tests: 31, Assertions: 57, Warnings: 1.

[Killed] TrueValue
Controllers/AdminController.php:269:17
             }
             
             if($stmt->execute($params)) {
-                return ['success' => true, 'message' => 'Producto actualizado exitosamente'];
+                return ['success' => false, 'message' => 'Producto actualizado exitosamente'];
             }
             
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProduct
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProduct
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:243

FAILURES!
Tests: 12, Assertions: 28, Failures: 1, Warnings: 1.

[Killed] FalseValue
Controllers/AdminController.php:272:13
                 return ['success' => true, 'message' => 'Producto actualizado exitosamente'];
             }
             
-            return ['success' => false, 'message' => 'Error al actualizar el producto'];
+            return ['success' => true, 'message' => 'Error al actualizar el producto'];
         } catch (\Exception $e) {
             error_log("Error en updateProduct: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateProductDatabaseError
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateProductDatabaseError
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:597

FAILURES!
Tests: 29, Assertions: 55, Failures: 1.

[Killed] PublicVisibility
Controllers/AdminController.php:279:5
         }
     }
 
-    public function getAllProducts() {
+    protected function getAllProducts()
         $stmt = $this->conn->query("SELECT * FROM `products`");
         $products = [];
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
Error: Call to protected method Controllers\AdminController::getAllProducts() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:212

ERRORS!
Tests: 10, Assertions: 23, Errors: 1.

[Killed] Foreach_
Controllers/AdminController.php:282:9
     public function getAllProducts() {
         $stmt = $this->conn->query("SELECT * FROM `products`");
         $products = [];
-        foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-            $product = new Product();
-            $product->setId($row['id']);
-            $product->setName($row['name']);
-            $product->setPrice($row['price']);
-            $product->setImage($row['image']);
-            $products[] = $product;
-        }
+        foreach (array() as $row) {
         return $products;
     }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
Failed asserting that actual size 0 matches expected size 1.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:215

FAILURES!
Tests: 10, Assertions: 25, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:284:13
         $products = [];
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $product = new Product();
-            $product->setId($row['id']);
+            
             $product->setName($row['name']);
             $product->setPrice($row['price']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:285:13
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $product = new Product();
             $product->setId($row['id']);
-            $product->setName($row['name']);
+            
             $product->setPrice($row['price']);
             $product->setImage($row['image']);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
Failed asserting that null matches expected 'Product 1'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:216

FAILURES!
Tests: 10, Assertions: 26, Failures: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:286:13
             $product = new Product();
             $product->setId($row['id']);
             $product->setName($row['name']);
-            $product->setPrice($row['price']);
+            
             $product->setImage($row['image']);
             $products[] = $product;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllProducts
Failed asserting that null matches expected 99.99.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:217

FAILURES!
Tests: 10, Assertions: 27, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:287:13
             $product->setId($row['id']);
             $product->setName($row['name']);
             $product->setPrice($row['price']);
-            $product->setImage($row['image']);
+            
             $products[] = $product;
         }

[Killed] PublicVisibility
Controllers/AdminController.php:293:5
         return $products;
     }
 
-    public function getAllOrders() {
+    protected function getAllOrders()
         $stmt = $this->conn->prepare("SELECT * FROM `orders`");
         $stmt->execute();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
Error: Call to protected method Controllers\AdminController::getAllOrders() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:270

ERRORS!
Tests: 12, Assertions: 29, Errors: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:295:9
 
     public function getAllOrders() {
         $stmt = $this->conn->prepare("SELECT * FROM `orders`");
-        $stmt->execute();
+        
         $orders = [];
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {

[Killed] Foreach_
Controllers/AdminController.php:297:9
         $stmt = $this->conn->prepare("SELECT * FROM `orders`");
         $stmt->execute();
         $orders = [];
-        foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-            $order = new Order();
-            $order->setId($row['id']);
-            $order->setUserId($row['user_id']);
-            $order->setPlacedOn($row['placed_on']);
-            $order->setName($row['name']);
-            $order->setNumber($row['number']);
-            $order->setEmail($row['email']);
-            $order->setAddress($row['address']);
-            $order->setTotalProducts($row['total_products']);
-            $order->setTotalPrice($row['total_price']);
-            $order->setMethod($row['method']);
-            $order->setPaymentStatus($row['payment_status']);
-            $orders[] = $order;
-        }
+        foreach (array() as $row) {
         return $orders;
     }
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
Failed asserting that actual size 0 matches expected size 1.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:273

FAILURES!
Tests: 12, Assertions: 31, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:300:13
         foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
             $order = new Order();
             $order->setId($row['id']);
-            $order->setUserId($row['user_id']);
+            
             $order->setPlacedOn($row['placed_on']);
             $order->setName($row['name']);

[Survived] MethodCallRemoval
Controllers/AdminController.php:301:13
             $order = new Order();
             $order->setId($row['id']);
             $order->setUserId($row['user_id']);
-            $order->setPlacedOn($row['placed_on']);
+            
             $order->setName($row['name']);
             $order->setNumber($row['number']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:302:13
             $order->setId($row['id']);
             $order->setUserId($row['user_id']);
             $order->setPlacedOn($row['placed_on']);
-            $order->setName($row['name']);
+            
             $order->setNumber($row['number']);
             $order->setEmail($row['email']);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
Failed asserting that null matches expected 'Customer 1'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:274

FAILURES!
Tests: 12, Assertions: 32, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:303:13
             $order->setUserId($row['user_id']);
             $order->setPlacedOn($row['placed_on']);
             $order->setName($row['name']);
-            $order->setNumber($row['number']);
+            
             $order->setEmail($row['email']);
             $order->setAddress($row['address']);

[Survived] MethodCallRemoval
Controllers/AdminController.php:304:13
             $order->setPlacedOn($row['placed_on']);
             $order->setName($row['name']);
             $order->setNumber($row['number']);
-            $order->setEmail($row['email']);
+            
             $order->setAddress($row['address']);
             $order->setTotalProducts($row['total_products']);

[Survived] MethodCallRemoval
Controllers/AdminController.php:305:13
             $order->setName($row['name']);
             $order->setNumber($row['number']);
             $order->setEmail($row['email']);
-            $order->setAddress($row['address']);
+            
             $order->setTotalProducts($row['total_products']);
             $order->setTotalPrice($row['total_price']);

[Survived] MethodCallRemoval
Controllers/AdminController.php:306:13
             $order->setNumber($row['number']);
             $order->setEmail($row['email']);
             $order->setAddress($row['address']);
-            $order->setTotalProducts($row['total_products']);
+            
             $order->setTotalPrice($row['total_price']);
             $order->setMethod($row['method']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:307:13
             $order->setEmail($row['email']);
             $order->setAddress($row['address']);
             $order->setTotalProducts($row['total_products']);
-            $order->setTotalPrice($row['total_price']);
+            
             $order->setMethod($row['method']);
             $order->setPaymentStatus($row['payment_status']);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllOrders
Failed asserting that null matches expected 199.98.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:275

FAILURES!
Tests: 12, Assertions: 33, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:308:13
             $order->setAddress($row['address']);
             $order->setTotalProducts($row['total_products']);
             $order->setTotalPrice($row['total_price']);
-            $order->setMethod($row['method']);
+            
             $order->setPaymentStatus($row['payment_status']);
             $orders[] = $order;

[Survived] MethodCallRemoval
Controllers/AdminController.php:309:13
             $order->setTotalProducts($row['total_products']);
             $order->setTotalPrice($row['total_price']);
             $order->setMethod($row['method']);
-            $order->setPaymentStatus($row['payment_status']);
+            
             $orders[] = $order;
         }

[Killed] PublicVisibility
Controllers/AdminController.php:315:5
         return $orders;
     }
 
-    public function updateOrderStatus($orderId, $status) {
+    protected function updateOrderStatus($orderId, $status)
         try {
             $order = new Order();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateOrderStatus
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateOrderStatus
Error: Call to protected method Controllers\AdminController::updateOrderStatus() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:81

ERRORS!
Tests: 3, Assertions: 7, Errors: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:318:13
     public function updateOrderStatus($orderId, $status) {
         try {
             $order = new Order();
-            $order->setId($orderId);
+            
             $order->setPaymentStatus($status);
             

[Survived] MethodCallRemoval
Controllers/AdminController.php:319:13
         try {
             $order = new Order();
             $order->setId($orderId);
-            $order->setPaymentStatus($status);
+            
             
             $stmt = $this->conn->prepare("UPDATE `orders` SET payment_status = ? WHERE id = ?");

[Survived] ArrayItemRemoval
Controllers/AdminController.php:322:13
             $order->setPaymentStatus($status);
             
             $stmt = $this->conn->prepare("UPDATE `orders` SET payment_status = ? WHERE id = ?");
-            return $stmt->execute([$order->getPaymentStatus(), $order->getId()]);
+            return $stmt->execute([$order->getId()]);
         } catch (\PDOException $e) {
             $this->handleDatabaseError($e);

[Killed] PublicVisibility
Controllers/AdminController.php:329:5
         }
     }
 
-    public function deleteOrder($orderId) {
+    protected function deleteOrder($orderId)
         try {
             $order = new Order();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteOrder
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testDeleteOrder
Error: Call to protected method Controllers\AdminController::deleteOrder() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:141

ERRORS!
Tests: 6, Assertions: 16, Errors: 1.

[Survived] ArrayItemRemoval
Controllers/AdminController.php:335:13
             $order->setId($orderId);
             
             $stmt = $this->conn->prepare("DELETE FROM `orders` WHERE id = ?");
-            return $stmt->execute([$order->getId()]);
+            return $stmt->execute([]);
         } catch (\PDOException $e) {
             $this->handleDatabaseError($e);

[Killed] PublicVisibility
Controllers/AdminController.php:342:5
         }
     }
 
-    public function getAllUsers() {
+    protected function getAllUsers()
         try {
             $stmt = $this->conn->prepare("SELECT * FROM `users`");
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
Error: Call to protected method Controllers\AdminController::getAllUsers() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:108

ERRORS!
Tests: 4, Assertions: 8, Errors: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:345:13
     public function getAllUsers() {
         try {
             $stmt = $this->conn->prepare("SELECT * FROM `users`");
-            $stmt->execute();
+            
             $users = [];
             

[Killed] Foreach_
Controllers/AdminController.php:348:13
             $stmt->execute();
             $users = [];
             
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $user = new User();
-                $user->setId($row['id']);
-                $user->setName($row['name']);
-                $user->setEmail($row['email']);
-                $user->setUserType($row['user_type']);
-                $users[] = $user;
-            }
+            foreach (array() as $row) {
             return $users;
         } catch (\PDOException $e) {
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
Failed asserting that actual size 0 matches expected size 2.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:111

FAILURES!
Tests: 4, Assertions: 10, Failures: 1.
