[Survived] MethodCallRemoval
Controllers/AdminController.php:350:17
             
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $user = new User();
-                $user->setId($row['id']);
+                
                 $user->setName($row['name']);
                 $user->setEmail($row['email']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:351:17
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $user = new User();
                 $user->setId($row['id']);
-                $user->setName($row['name']);
+                
                 $user->setEmail($row['email']);
                 $user->setUserType($row['user_type']);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
Failed asserting that null matches expected 'Admin User'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:114

FAILURES!
Tests: 4, Assertions: 13, Failures: 1.

[Killed] MethodCallRemoval
Controllers/AdminController.php:352:17
                 $user = new User();
                 $user->setId($row['id']);
                 $user->setName($row['name']);
-                $user->setEmail($row['email']);
+                
                 $user->setUserType($row['user_type']);
                 $users[] = $user;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllUsers
Failed asserting that null matches expected 'user@test.com'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:115

FAILURES!
Tests: 4, Assertions: 14, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:353:17
                 $user->setId($row['id']);
                 $user->setName($row['name']);
                 $user->setEmail($row['email']);
-                $user->setUserType($row['user_type']);
+                
                 $users[] = $user;
             }

[Killed] PublicVisibility
Controllers/AdminController.php:363:5
         }
     }
 
-    public function deleteUser($userId) {
+    protected function deleteUser($userId)
         try {
             $user = new User();
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteUser
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testDeleteUser
Error: Call to protected method Controllers\AdminController::deleteUser() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:154

ERRORS!
Tests: 7, Assertions: 17, Errors: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:366:13
     public function deleteUser($userId) {
         try {
             $user = new User();
-            $user->setId($userId);
+            
             
             $stmt = $this->conn->prepare("DELETE FROM `users` WHERE id = ?");

[Killed] PublicVisibility
Controllers/AdminController.php:376:5
         }
     }
 
-    public function getAllMessages() {
+    protected function getAllMessages()
         try {
             $stmt = $this->conn->query("SELECT * FROM `message`");
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
Error: Call to protected method Controllers\AdminController::getAllMessages() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:176

ERRORS!
Tests: 8, Assertions: 18, Errors: 1.

[Killed] Foreach_
Controllers/AdminController.php:380:13
         try {
             $stmt = $this->conn->query("SELECT * FROM `message`");
             $messages = [];
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $message = new Message();
-                $message->setId($row['id']);
-                $message->setUserId($row['user_id']);
-                $message->setMessage($row['message']);
-                $message->setName($row['name']);
-                $message->setEmail($row['email']);
-                $message->setNumber($row['number']);
-                $messages[] = $message;
-            }
+            foreach (array() as $row) {
             return $messages;
         } catch (\PDOException $e) {
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
Failed asserting that actual size 0 matches expected size 1.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:179

FAILURES!
Tests: 8, Assertions: 20, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:382:17
             $messages = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $message = new Message();
-                $message->setId($row['id']);
+                
                 $message->setUserId($row['user_id']);
                 $message->setMessage($row['message']);

[Survived] MethodCallRemoval
Controllers/AdminController.php:383:17
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $message = new Message();
                 $message->setId($row['id']);
-                $message->setUserId($row['user_id']);
+                
                 $message->setMessage($row['message']);
                 $message->setName($row['name']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:384:17
                 $message = new Message();
                 $message->setId($row['id']);
                 $message->setUserId($row['user_id']);
-                $message->setMessage($row['message']);
+                
                 $message->setName($row['name']);
                 $message->setEmail($row['email']);
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
Failed asserting that null matches expected 'Test message'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:180

FAILURES!
Tests: 8, Assertions: 21, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:385:17
                 $message->setId($row['id']);
                 $message->setUserId($row['user_id']);
                 $message->setMessage($row['message']);
-                $message->setName($row['name']);
+                
                 $message->setEmail($row['email']);
                 $message->setNumber($row['number']);

[Killed] MethodCallRemoval
Controllers/AdminController.php:386:17
                 $message->setUserId($row['user_id']);
                 $message->setMessage($row['message']);
                 $message->setName($row['name']);
-                $message->setEmail($row['email']);
+                
                 $message->setNumber($row['number']);
                 $messages[] = $message;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetAllMessages
Failed asserting that null matches expected 'test@test.com'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:181

FAILURES!
Tests: 8, Assertions: 22, Failures: 1.

[Survived] MethodCallRemoval
Controllers/AdminController.php:387:17
                 $message->setMessage($row['message']);
                 $message->setName($row['name']);
                 $message->setEmail($row['email']);
-                $message->setNumber($row['number']);
+                
                 $messages[] = $message;
             }

[Killed] PublicVisibility
Controllers/AdminController.php:397:5
         }
     }
 
-    public function deleteMessage($messageId) {
+    protected function deleteMessage($messageId)
         try {
             $query = "DELETE FROM `message` WHERE id = ?";
killedBy: Tests\Unit\Controllers\AdminControllerTest::testDeleteMessage
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testDeleteMessage
Error: Call to protected method Controllers\AdminController::deleteMessage() from scope Tests\Unit\Controllers\AdminControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControllerTest.php:192

ERRORS!
Tests: 9, Assertions: 22, Errors: 1.

[Survived] ArrayItemRemoval
Controllers/AdminController.php:401:13
         try {
             $query = "DELETE FROM `message` WHERE id = ?";
             $stmt = $this->conn->prepare($query);
-            return $stmt->execute([$messageId]);
+            return $stmt->execute([]);
         } catch (\PDOException $e) {
             $this->handleDatabaseError($e);
