[Killed] ProtectedVisibility
Controllers/ContactController.php:17:5
     }
 
     // Agregar estos métodos protegidos para permitir el mock en las pruebas
-    protected function createUser()
+    private function createUser()
     {
         return new User();
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] NewObject
Controllers/ContactController.php:19:9
     // Agregar estos métodos protegidos para permitir el mock en las pruebas
     protected function createUser()
     {
-        return new User();
+        new User();
+        return null;
     }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] ProtectedVisibility
Controllers/ContactController.php:22:5
         return new User();
     }
 
-    protected function createMessage()
+    private function createMessage()
     {
         return new Message();
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_exitoso
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_exitoso
PHPUnit\Framework\MockObject\MethodCannotBeConfiguredException: Trying to configure method "createMessage" which cannot be configured because it does not exist, has not been specified, is final, or is static

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest

[Killed] NewObject
Controllers/ContactController.php:24:9
 
     protected function createMessage()
     {
-        return new Message();
+        new Message();
+        return null;
     }
 
killedBy: Tests\Unit\Controllers\ContactControllerTest::crear_mensaje_retorna_instancia_message
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::crear_mensaje_retorna_instancia_message
Failed asserting that null is an instance of class "Models\Message".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:179

FAILURES!
Tests: 8, Assertions: 14, Failures: 1.

[Killed] PublicVisibility
Controllers/ContactController.php:27:5
         return new Message();
     }
 
-    public function sendMessage($userData) {
+    protected function sendMessage($userData)
         try {
             // Validar que todos los campos requeridos existan
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] LogicalOr
Controllers/ContactController.php:30:13
     public function sendMessage($userData) {
         try {
             // Validar que todos los campos requeridos existan
-            if (!isset($userData['user_id']) || !isset($userData['name']) || 
-                !isset($userData['email']) || !isset($userData['message'])) {
+            if ((!isset($userData['user_id']) || !isset($userData['name']) || !isset($userData['email'])) && !isset($userData['message'])) {
                 return ['success' => false, 'message' => 'Faltan campos requeridos'];
             }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] LogicalNot
Controllers/ContactController.php:30:13
     public function sendMessage($userData) {
         try {
             // Validar que todos los campos requeridos existan
-            if (!isset($userData['user_id']) || !isset($userData['name']) || 
+            if (!isset($userData['user_id']) || isset($userData['name']) || !isset($userData['email']) || !isset($userData['message'])) {
                 !isset($userData['email']) || !isset($userData['message'])) {
                 return ['success' => false, 'message' => 'Faltan campos requeridos'];
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] LogicalNot
Controllers/ContactController.php:31:17
         try {
             // Validar que todos los campos requeridos existan
             if (!isset($userData['user_id']) || !isset($userData['name']) || 
-                !isset($userData['email']) || !isset($userData['message'])) {
+                if (!isset($userData['user_id']) || !isset($userData['name']) || isset($userData['email']) || !isset($userData['message'])) {
                 return ['success' => false, 'message' => 'Faltan campos requeridos'];
             }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] LogicalNot
Controllers/ContactController.php:31:17
         try {
             // Validar que todos los campos requeridos existan
             if (!isset($userData['user_id']) || !isset($userData['name']) || 
-                !isset($userData['email']) || !isset($userData['message'])) {
+                if (!isset($userData['user_id']) || !isset($userData['name']) || !isset($userData['email']) || isset($userData['message'])) {
                 return ['success' => false, 'message' => 'Faltan campos requeridos'];
             }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/ContactController.php:32:17
             // Validar que todos los campos requeridos existan
             if (!isset($userData['user_id']) || !isset($userData['name']) || 
                 !isset($userData['email']) || !isset($userData['message'])) {
-                return ['success' => false, 'message' => 'Faltan campos requeridos'];
+                return ['success' => true, 'message' => 'Faltan campos requeridos'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] ArrayItemRemoval
Controllers/ContactController.php:32:17
             // Validar que todos los campos requeridos existan
             if (!isset($userData['user_id']) || !isset($userData['name']) || 
                 !isset($userData['email']) || !isset($userData['message'])) {
-                return ['success' => false, 'message' => 'Faltan campos requeridos'];
+                return ['message' => 'Faltan campos requeridos'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ContactController.php:37:13
 
             // Modificar la creación de User y Message
             $user = $this->createUser();
-            $user->setId($userData['user_id']);
+            
             if (!$user->exists($this->conn)) {
                 return ['success' => false, 'message' => 'Usuario no encontrado'];
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] LogicalNot
Controllers/ContactController.php:38:13
             // Modificar la creación de User y Message
             $user = $this->createUser();
             $user->setId($userData['user_id']);
-            if (!$user->exists($this->conn)) {
+            if ($user->exists($this->conn)) {
                 return ['success' => false, 'message' => 'Usuario no encontrado'];
             }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/ContactController.php:39:17
             $user = $this->createUser();
             $user->setId($userData['user_id']);
             if (!$user->exists($this->conn)) {
-                return ['success' => false, 'message' => 'Usuario no encontrado'];
+                return ['success' => true, 'message' => 'Usuario no encontrado'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ContactController.php:43:13
             }
 
             $message = $this->createMessage();
-            $message->setUserId($userData['user_id']);
+            
             $message->setName($userData['name']);
             $message->setEmail($userData['email']);
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
Expectation failed for method name is "setUserId" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ContactController.php:44:13
 
             $message = $this->createMessage();
             $message->setUserId($userData['user_id']);
-            $message->setName($userData['name']);
+            
             $message->setEmail($userData['email']);
             $message->setNumber($userData['number']);
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
Expectation failed for method name is "setName" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ContactController.php:45:13
             $message = $this->createMessage();
             $message->setUserId($userData['user_id']);
             $message->setName($userData['name']);
-            $message->setEmail($userData['email']);
+            
             $message->setNumber($userData['number']);
             $message->setMessage($userData['message']);
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
Expectation failed for method name is "setEmail" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ContactController.php:46:13
             $message->setUserId($userData['user_id']);
             $message->setName($userData['name']);
             $message->setEmail($userData['email']);
-            $message->setNumber($userData['number']);
+            
             $message->setMessage($userData['message']);
 
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
Expectation failed for method name is "setNumber" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ContactController.php:47:13
             $message->setName($userData['name']);
             $message->setEmail($userData['email']);
             $message->setNumber($userData['number']);
-            $message->setMessage($userData['message']);
+            
 
             if ($message->exists($this->conn)) {  // Asumiendo que existe un método exists() en Message
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_valida_setters
Expectation failed for method name is "setMessage" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Killed] FalseValue
Controllers/ContactController.php:50:17
             $message->setMessage($userData['message']);
 
             if ($message->exists($this->conn)) {  // Asumiendo que existe un método exists() en Message
-                return ['success' => false, 'message' => '¡Mensaje ya enviado!'];
+                return ['success' => true, 'message' => '¡Mensaje ya enviado!'];
             }
 
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_ya_enviado
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_ya_enviado
Failed asserting that true is identical to false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:111

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/ContactController.php:50:17
             $message->setMessage($userData['message']);
 
             if ($message->exists($this->conn)) {  // Asumiendo que existe un método exists() en Message
-                return ['success' => false, 'message' => '¡Mensaje ya enviado!'];
+                return ['message' => '¡Mensaje ya enviado!'];
             }
 
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_ya_enviado
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_ya_enviado
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:111

ERRORS!
Tests: 4, Assertions: 6, Errors: 1.

[Killed] TrueValue
Controllers/ContactController.php:54:17
             }
 
             if ($message->save($this->conn)) {
-                return ['success' => true, 'message' => '¡Mensaje enviado exitosamente!'];
+                return ['success' => false, 'message' => '¡Mensaje enviado exitosamente!'];
             }
 
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_exitoso
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_exitoso
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:56

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/ContactController.php:58:13
             }
 
             // Añadir log específico si save() falla
-            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
+            error_log($userData['user_id']);
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {

[Survived] FunctionCallRemoval
Controllers/ContactController.php:58:13
             }
 
             // Añadir log específico si save() falla
-            error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
+            
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {

[Killed] FalseValue
Controllers/ContactController.php:59:13
 
             // Añadir log específico si save() falla
             error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
-            return ['success' => false, 'message' => 'Error al enviar mensaje'];
+            return ['success' => true, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_error_al_guardar
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_error_al_guardar
Failed asserting that true is identical to false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:132

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Survived] FunctionCallRemoval
Controllers/ContactController.php:61:13
             error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
-            error_log("Error al enviar mensaje: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
         }

[Survived] ConcatOperandRemoval
Controllers/ContactController.php:61:13
             error_log("Error en save(): Falló al guardar el mensaje para usuario ID: " . $userData['user_id']);
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
-            error_log("Error al enviar mensaje: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
         }

[Killed] FalseValue
Controllers/ContactController.php:62:13
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
+            return ['success' => true, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
         }
     }
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_lanza_excepcion
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_lanza_excepcion
Failed asserting that true is identical to false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:152

FAILURES!
Tests: 6, Assertions: 11, Failures: 1.

[Killed] ConcatOperandRemoval
Controllers/ContactController.php:62:13
             return ['success' => false, 'message' => 'Error al enviar mensaje'];
         } catch (\Exception $e) {
             error_log("Error al enviar mensaje: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al enviar mensaje: ' . $e->getMessage()];
+            return ['success' => false, 'message' => $e->getMessage()];
         }
     }
killedBy: Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_lanza_excepcion
statusReason: 1) Tests\Unit\Controllers\ContactControllerTest::enviar_mensaje_lanza_excepcion
Failed asserting that 'Error de conexión' contains "Error al enviar mensaje".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ContactControllerTest.php:153

FAILURES!
Tests: 6, Assertions: 12, Failures: 1.
