[Killed] PublicVisibility
Controllers/OrderController.php:18:5
         $this->conn = $conn;
     }
 
-    public function getOrders($userId) {
+    protected function getOrders($userId)
         try {
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE user_id = ?");
killedBy: Tests\Unit\Controllers\OrderControllerTest::manejar_error_base_datos_en_obtener_pedidos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::manejar_error_base_datos_en_obtener_pedidos
Error: Call to protected method Controllers\OrderController::getOrders() from scope Tests\Unit\Controllers\OrderControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:206

ERRORS!
Tests: 7, Assertions: 24, Errors: 1.

[Survived] MethodCallRemoval
Controllers/OrderController.php:40:13
             }
             return $orders;
         } catch (\Exception $e) {
-            $this->handleDatabaseError($e);
+            
             return [];
         }

[Killed] PublicVisibility
Controllers/OrderController.php:45:5
         }
     }
 
-    public function updatePaymentStatus($orderId, $status) {
+    protected function updatePaymentStatus($orderId, $status)
         try {
             $stmt = $this->conn->prepare("UPDATE orders SET payment_status = ? WHERE id = ?");
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] Foreach_
Controllers/OrderController.php:70:13
             $stmt = $this->conn->prepare("SELECT * FROM `orders`");
             $stmt->execute();
             $orders = [];
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $order = new Order();
-                $order->setUserId($row['user_id']);
-                $order->setName($row['name']);
-                $order->setEmail($row['email']);
-                $order->setMethod($row['method']);
-                $order->setAddress($row['address']);
-                $order->setTotalProducts($row['total_products']);
-                $order->setTotalPrice($row['total_price']);
-                $orders[] = $order;
-            }
+            foreach (array() as $row) {
             return $orders;
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_pedidos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_pedidos
Failed asserting that an array is not empty.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:172

FAILURES!
Tests: 5, Assertions: 16, Failures: 1.

[Killed] MethodCallRemoval
Controllers/OrderController.php:72:17
             $orders = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $order = new Order();
-                $order->setUserId($row['user_id']);
+                
                 $order->setName($row['name']);
                 $order->setEmail($row['email']);
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_pedidos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_pedidos
Failed asserting that null is identical to 1.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:174

FAILURES!
Tests: 5, Assertions: 18, Failures: 1.

[Survived] MethodCallRemoval
Controllers/OrderController.php:73:17
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $order = new Order();
                 $order->setUserId($row['user_id']);
-                $order->setName($row['name']);
+                
                 $order->setEmail($row['email']);
                 $order->setMethod($row['method']);

[Survived] MethodCallRemoval
Controllers/OrderController.php:74:17
                 $order = new Order();
                 $order->setUserId($row['user_id']);
                 $order->setName($row['name']);
-                $order->setEmail($row['email']);
+                
                 $order->setMethod($row['method']);
                 $order->setAddress($row['address']);

[Survived] MethodCallRemoval
Controllers/OrderController.php:75:17
                 $order->setUserId($row['user_id']);
                 $order->setName($row['name']);
                 $order->setEmail($row['email']);
-                $order->setMethod($row['method']);
+                
                 $order->setAddress($row['address']);
                 $order->setTotalProducts($row['total_products']);

[Survived] MethodCallRemoval
Controllers/OrderController.php:76:17
                 $order->setName($row['name']);
                 $order->setEmail($row['email']);
                 $order->setMethod($row['method']);
-                $order->setAddress($row['address']);
+                
                 $order->setTotalProducts($row['total_products']);
                 $order->setTotalPrice($row['total_price']);

[Killed] PublicVisibility
Controllers/OrderController.php:88:5
         }
     }
 
-    public function createOrder($userData, $userId) {
+    protected function createOrder($userData, $userId)
         try {
             $order = new Order();
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:91:13
     public function createOrder($userData, $userId) {
         try {
             $order = new Order();
-            $order->setUserId($userId);
+            
             $order->setName($userData['name']);
             $order->setNumber($userData['number']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:92:13
         try {
             $order = new Order();
             $order->setUserId($userId);
-            $order->setName($userData['name']);
+            
             $order->setNumber($userData['number']);
             $order->setEmail($userData['email']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:93:13
             $order = new Order();
             $order->setUserId($userId);
             $order->setName($userData['name']);
-            $order->setNumber($userData['number']);
+            
             $order->setEmail($userData['email']);
             $order->setMethod($userData['method']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:94:13
             $order->setUserId($userId);
             $order->setName($userData['name']);
             $order->setNumber($userData['number']);
-            $order->setEmail($userData['email']);
+            
             $order->setMethod($userData['method']);
             
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:95:13
             $order->setName($userData['name']);
             $order->setNumber($userData['number']);
             $order->setEmail($userData['email']);
-            $order->setMethod($userData['method']);
+            
             
             // Obtener productos del carrito
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/OrderController.php:100:17
             // Obtener productos del carrito
             $cartItems = $this->getCartItems($userId);
             if(empty($cartItems)) {
-                return ['success' => false, 'message' => 'El carrito está vacío'];
+                return ['success' => true, 'message' => 'El carrito está vacío'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] ArrayItemRemoval
Controllers/OrderController.php:100:17
             // Obtener productos del carrito
             $cartItems = $this->getCartItems($userId);
             if(empty($cartItems)) {
-                return ['success' => false, 'message' => 'El carrito está vacío'];
+                return ['message' => 'El carrito está vacío'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Survived] DecrementInteger
Controllers/OrderController.php:104:13
             }
 
             // Calcular total y preparar lista de productos
-            $cartTotal = 0;
+            $cartTotal = -1;
             $products = [];
             foreach($cartItems as $item) {

[Survived] Foreach_
Controllers/OrderController.php:106:13
             // Calcular total y preparar lista de productos
             $cartTotal = 0;
             $products = [];
-            foreach($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += ($item['price'] * $item['quantity']);
-            }
+            foreach (array() as $item) {
             $totalProducts = implode(', ', $products);
 

[Survived] Concat
Controllers/OrderController.php:107:17
             $cartTotal = 0;
             $products = [];
             foreach($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = $item['name'] . $item['quantity'] . ' (' . ')';
                 $cartTotal += ($item['price'] * $item['quantity']);
             }

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:107:17
             $cartTotal = 0;
             $products = [];
             foreach($cartItems as $item) {
-                $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
+                $products[] = $item['name'] . ' (' . ')';
                 $cartTotal += ($item['price'] * $item['quantity']);
             }

[Survived] Multiplication
Controllers/OrderController.php:108:17
             $products = [];
             foreach($cartItems as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += ($item['price'] * $item['quantity']);
+                $cartTotal += $item['price'] / $item['quantity'];
             }
             $totalProducts = implode(', ', $products);

[Survived] Assignment
Controllers/OrderController.php:108:17
             $products = [];
             foreach($cartItems as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += ($item['price'] * $item['quantity']);
+                $cartTotal = $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);

[Survived] Concat
Controllers/OrderController.php:113:13
             $totalProducts = implode(', ', $products);
 
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . 
-                      $userData['street'] . ', ' . 
-                      $userData['city'] . ', ' . 
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . $userData['city'] . ', ' . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
                       $userData['country'] . ' - ' . 
                       $userData['pin_code'];

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:113:13
             $totalProducts = implode(', ', $products);
 
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . 
+            $address = $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
                       $userData['street'] . ', ' . 
                       $userData['city'] . ', ' . 

[Survived] MethodCallRemoval
Controllers/OrderController.php:120:13
                       $userData['pin_code'];
             
             // Establecer valores adicionales en el objeto Order
-            $order->setAddress($address);
+            
             $order->setTotalProducts($totalProducts);
             $order->setTotalPrice($cartTotal);

[Survived] MethodCallRemoval
Controllers/OrderController.php:121:13
             
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
-            $order->setTotalProducts($totalProducts);
+            
             $order->setTotalPrice($cartTotal);
             

[Survived] MethodCallRemoval
Controllers/OrderController.php:122:13
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);
-            $order->setTotalPrice($cartTotal);
+            
             
             // Verificar si la orden ya existe

[Killed] MethodCallRemoval
Controllers/OrderController.php:130:13
                 method = ? AND address = ? AND 
                 total_products = ? AND total_price = ?");
             
-            $stmt->execute([
-                $order->getName(),
-                $order->getNumber(),
-                $order->getEmail(),
-                $order->getMethod(),
-                $order->getAddress(),
-                $order->getTotalProducts(),
-                $order->getTotalPrice()
-            ]);
+            
 
             if($stmt->rowCount() > 0) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Expectation failed for method name is "execute" when invoked 4 time(s).
Method was expected to be called 4 times, actually called 3 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] FalseValue
Controllers/OrderController.php:141:17
             ]);
 
             if($stmt->rowCount() > 0) {
-                return ['success' => false, 'message' => '¡Pedido ya realizado!'];
+                return ['success' => true, 'message' => '¡Pedido ya realizado!'];
             }
 
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido_duplicado
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido_duplicado
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:356

FAILURES!
Tests: 11, Assertions: 41, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/OrderController.php:141:17
             ]);
 
             if($stmt->rowCount() > 0) {
-                return ['success' => false, 'message' => '¡Pedido ya realizado!'];
+                return ['message' => '¡Pedido ya realizado!'];
             }
 
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido_duplicado
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido_duplicado
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:356

ERRORS!
Tests: 11, Assertions: 40, Errors: 1.

[Killed] MethodCallRemoval
Controllers/OrderController.php:150:13
                 total_products, total_price, placed_on) 
                 VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)");
 
-            $stmt->execute([
-                $order->getUserId(),
-                $order->getName(),
-                $order->getNumber(),
-                $order->getEmail(),
-                $order->getMethod(),
-                $order->getAddress(),
-                $order->getTotalProducts(),
-                $order->getTotalPrice(),
-                date('d-M-Y')
-            ]);
+            
 
             // Limpiar carrito
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Expectation failed for method name is "execute" when invoked 4 time(s).
Method was expected to be called 4 times, actually called 3 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItemRemoval
Controllers/OrderController.php:150:13
                 total_products, total_price, placed_on) 
                 VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)");
 
-            $stmt->execute([
-                $order->getUserId(),
-                $order->getName(),
-                $order->getNumber(),
-                $order->getEmail(),
-                $order->getMethod(),
-                $order->getAddress(),
-                $order->getTotalProducts(),
-                $order->getTotalPrice(),
-                date('d-M-Y')
-            ]);
+            $stmt->execute([$order->getName(), $order->getNumber(), $order->getEmail(), $order->getMethod(), $order->getAddress(), $order->getTotalProducts(), $order->getTotalPrice(), date('d-M-Y')]);
 
             // Limpiar carrito

[Killed] MethodCallRemoval
Controllers/OrderController.php:163:13
             ]);
 
             // Limpiar carrito
-            $this->clearCart($userId);
+            
 
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Expectation failed for method name is "prepare" when invoked 4 time(s).
Method was expected to be called 4 times, actually called 3 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] TrueValue
Controllers/OrderController.php:165:13
             // Limpiar carrito
             $this->clearCart($userId);
 
-            return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
+            return ['success' => false, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
             error_log("Error al crear orden: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:65

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] Concat
Controllers/OrderController.php:167:13
 
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
-            error_log("Error al crear orden: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al crear orden: ");
             return ['success' => false, 'message' => 'Error al procesar el pedido'];
         }

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:167:13
 
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
-            error_log("Error al crear orden: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error al procesar el pedido'];
         }

[Killed] FalseValue
Controllers/OrderController.php:168:13
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
             error_log("Error al crear orden: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al procesar el pedido'];
+            return ['success' => true, 'message' => 'Error al procesar el pedido'];
         }
     }
killedBy: Tests\Unit\Controllers\OrderControllerTest::manejar_error_al_crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::manejar_error_al_crear_pedido
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:382

FAILURES!
Tests: 12, Assertions: 45, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/OrderController.php:168:13
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
             error_log("Error al crear orden: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al procesar el pedido'];
+            return ['message' => 'Error al procesar el pedido'];
         }
     }
killedBy: Tests\Unit\Controllers\OrderControllerTest::manejar_error_al_crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::manejar_error_al_crear_pedido
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:382

ERRORS!
Tests: 12, Assertions: 44, Errors: 1.

[Killed] MethodCallRemoval
Controllers/OrderController.php:174:9
 
     private function getCartItems($userId) {
         $stmt = $this->conn->prepare("SELECT * FROM cart WHERE user_id = ?");
-        $stmt->execute([$userId]);
+        
         return $stmt->fetchAll(\PDO::FETCH_ASSOC);
     }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/OrderController.php:180:9
 
     private function clearCart($userId) {
         $stmt = $this->conn->prepare("DELETE FROM cart WHERE user_id = ?");
-        $stmt->execute([$userId]);
+        
     }
 
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Expectation failed for method name is "execute" when invoked 4 time(s).
Method was expected to be called 4 times, actually called 3 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItemRemoval
Controllers/OrderController.php:180:9
 
     private function clearCart($userId) {
         $stmt = $this->conn->prepare("DELETE FROM cart WHERE user_id = ?");
-        $stmt->execute([$userId]);
+        $stmt->execute([]);
     }
 

[Killed] PublicVisibility
Controllers/OrderController.php:183:5
         $stmt->execute([$userId]);
     }
 
-    public function getUserOrders($userId) {
+    protected function getUserOrders($userId)
         try {
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE user_id = ?");
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Error: Call to protected method Controllers\OrderController::getUserOrders() from scope Tests\Unit\Controllers\OrderControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:100

ERRORS!
Tests: 2, Assertions: 4, Errors: 1.

[Killed] MethodCallRemoval
Controllers/OrderController.php:186:13
     public function getUserOrders($userId) {
         try {
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE user_id = ?");
-            $stmt->execute([$userId]);
+            
             $orders = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/OrderController.php:186:13
     public function getUserOrders($userId) {
         try {
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE user_id = ?");
-            $stmt->execute([$userId]);
+            $stmt->execute([]);
             $orders = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Failed asserting that an array is not empty.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:102

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Killed] Foreach_
Controllers/OrderController.php:188:13
             $stmt = $this->conn->prepare("SELECT * FROM orders WHERE user_id = ?");
             $stmt->execute([$userId]);
             $orders = [];
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $order = new Order();
-                $order->setUserId($row['user_id']);
-                $order->setName($row['name']);
-                $order->setNumber($row['number']);
-                $order->setEmail($row['email']);
-                $order->setMethod($row['method']);
-                $order->setAddress($row['address']);
-                $order->setTotalProducts($row['total_products']);
-                $order->setTotalPrice($row['total_price']);
-                $order->setPaymentStatus($row['payment_status']);
-                $order->setPlacedOn($row['placed_on']);
-                $orders[] = $order;
-            }
+            foreach (array() as $row) {
             return $orders;
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Failed asserting that an array is not empty.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:102

FAILURES!
Tests: 2, Assertions: 5, Failures: 1.

[Survived] MethodCallRemoval
Controllers/OrderController.php:198:17
                 $order->setAddress($row['address']);
                 $order->setTotalProducts($row['total_products']);
                 $order->setTotalPrice($row['total_price']);
-                $order->setPaymentStatus($row['payment_status']);
+                
                 $order->setPlacedOn($row['placed_on']);
                 $orders[] = $order;

[Survived] MethodCallRemoval
Controllers/OrderController.php:199:17
                 $order->setTotalProducts($row['total_products']);
                 $order->setTotalPrice($row['total_price']);
                 $order->setPaymentStatus($row['payment_status']);
-                $order->setPlacedOn($row['placed_on']);
+                
                 $orders[] = $order;
             }

[Killed] Foreach_
Controllers/OrderController.php:213:13
         try {
             $stmt = $this->conn->query("SELECT * FROM `products`");
             $products = [];
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $product = new Product();
-                $product->setName($row['name']);
-                $product->setPrice($row['price']);
-                $product->setImage($row['image']);
-                $products[] = $product;
-            }
+            foreach (array() as $row) {
             return $products;
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
Failed asserting that an array is not empty.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:249

FAILURES!
Tests: 8, Assertions: 27, Failures: 1.
