[Killed] MethodCallRemoval
Controllers/OrderController.php:215:17
             $products = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $product = new Product();
-                $product->setName($row['name']);
+                
                 $product->setPrice($row['price']);
                 $product->setImage($row['image']);
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
Failed asserting that null matches expected 'Producto 1'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:251

FAILURES!
Tests: 8, Assertions: 29, Failures: 1.

[Killed] Foreach_
Controllers/OrderController.php:232:13
             $stmt = $this->conn->prepare("SELECT * FROM `users`");
             $stmt->execute();
             $users = [];
-            foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
-                $user = new User();
-                $user->setName($row['name']);
-                $user->setEmail($row['email']);
-                $user->setUserType($row['user_type']);
-                $users[] = $user;
-            }
+            foreach (array() as $row) {
             return $users;
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
Failed asserting that an array is not empty.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:283

FAILURES!
Tests: 9, Assertions: 32, Failures: 1.

[Killed] MethodCallRemoval
Controllers/OrderController.php:234:17
             $users = [];
             foreach($stmt->fetchAll(\PDO::FETCH_ASSOC) as $row) {
                 $user = new User();
-                $user->setName($row['name']);
+                
                 $user->setEmail($row['email']);
                 $user->setUserType($row['user_type']);
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
Failed asserting that null matches expected 'Usuario 1'.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:285

FAILURES!
Tests: 9, Assertions: 34, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:247:9
     }
 
     private function handleDatabaseError(\Exception $e) {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log($e->getMessage());
     }
 } 

[Survived] ConcatOperandRemoval
Controllers/OrderController.php:247:9
     }
 
     private function handleDatabaseError(\Exception $e) {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log("Error en la base de datos: ");
     }
 } 
