[Killed] PublicVisibility
Controllers/ProductController.php:17:5
         $this->conn = $conn;
     }
 
-    public function getLatestProducts($limit = 6) {
+    protected function getLatestProducts($limit = 6)
         try {
             $query = "SELECT * FROM products LIMIT :limit";
killedBy: Tests\Unit\Controllers\ProductControllerTest::obtener_productos_recientes
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::obtener_productos_recientes
Error: Call to protected method Controllers\ProductController::getLatestProducts() from scope Tests\Unit\Controllers\ProductControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:47

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] DecrementInteger
Controllers/ProductController.php:17:5
         $this->conn = $conn;
     }
 
-    public function getLatestProducts($limit = 6) {
+    public function getLatestProducts($limit = 5)
         try {
             $query = "SELECT * FROM products LIMIT :limit";

[Survived] MethodCallRemoval
Controllers/ProductController.php:21:13
         try {
             $query = "SELECT * FROM products LIMIT :limit";
             $stmt = $this->conn->prepare($query);
-            $stmt->bindValue(':limit', $limit, \PDO::PARAM_INT);
+            
             $stmt->execute();
             

[Killed] MethodCallRemoval
Controllers/ProductController.php:22:13
             $query = "SELECT * FROM products LIMIT :limit";
             $stmt = $this->conn->prepare($query);
             $stmt->bindValue(':limit', $limit, \PDO::PARAM_INT);
-            $stmt->execute();
+            
             
             $products = [];
killedBy: Tests\Unit\Controllers\ProductControllerTest::obtener_productos_recientes
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::obtener_productos_recientes
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Survived] FunctionCallRemoval
Controllers/ProductController.php:35:13
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener productos: " . $e->getMessage());
+            
             return [];
         }

[Survived] ConcatOperandRemoval
Controllers/ProductController.php:35:13
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener productos: " . $e->getMessage());
+            error_log("Error al obtener productos: ");
             return [];
         }

[Killed] PublicVisibility
Controllers/ProductController.php:40:5
         }
     }
 
-    public function addToCart($userId, $productData) {
+    protected function addToCart($userId, $productData)
         try {
             $cart = new Cart();
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:43:13
     public function addToCart($userId, $productData) {
         try {
             $cart = new Cart();
-            $cart->setUserId($userId);
+            
             $cart->setName($productData['product_name']);
             $cart->setPrice($productData['product_price']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:44:13
         try {
             $cart = new Cart();
             $cart->setUserId($userId);
-            $cart->setName($productData['product_name']);
+            
             $cart->setPrice($productData['product_price']);
             $cart->setQuantity($productData['product_quantity']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:45:13
             $cart = new Cart();
             $cart->setUserId($userId);
             $cart->setName($productData['product_name']);
-            $cart->setPrice($productData['product_price']);
+            
             $cart->setQuantity($productData['product_quantity']);
             $cart->setImage($productData['product_image']);
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:46:13
             $cart->setUserId($userId);
             $cart->setName($productData['product_name']);
             $cart->setPrice($productData['product_price']);
-            $cart->setQuantity($productData['product_quantity']);
+            
             $cart->setImage($productData['product_image']);
             
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:47:13
             $cart->setName($productData['product_name']);
             $cart->setPrice($productData['product_price']);
             $cart->setQuantity($productData['product_quantity']);
-            $cart->setImage($productData['product_image']);
+            
             
             // Verificar si el producto ya está en el carrito
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:51:13
             
             // Verificar si el producto ya está en el carrito
             $stmt = $this->conn->prepare("SELECT * FROM cart WHERE user_id = ? AND name = ?");
-            $stmt->execute([$userId, $cart->getName()]);
+            
             
             if($stmt->rowCount() > 0) {
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/ProductController.php:54:17
             $stmt->execute([$userId, $cart->getName()]);
             
             if($stmt->rowCount() > 0) {
-                return ['success' => false, 'message' => 'El producto ya está en el carrito'];
+                return ['success' => true, 'message' => 'El producto ya está en el carrito'];
             }
 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:62:13
                      VALUES (?, ?, ?, ?, ?)";
             $stmt = $this->conn->prepare($query);
             
-            $stmt->execute([
-                $cart->getUserId(),
-                $cart->getName(),
-                $cart->getPrice(),
-                $cart->getQuantity(),
-                $cart->getImage()
-            ]);
+            
             
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Expectation failed for method name is "execute" when invoked 2 time(s).
Method was expected to be called 2 times, actually called 1 times.

FAILURES!
Tests: 2, Assertions: 9, Failures: 1.

[Killed] TrueValue
Controllers/ProductController.php:70:13
                 $cart->getImage()
             ]);
             
-            return ['success' => true, 'message' => 'Producto añadido al carrito'];
+            return ['success' => false, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
             error_log("Error al añadir al carrito: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:77

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Survived] Concat
Controllers/ProductController.php:72:13
             
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
-            error_log("Error al añadir al carrito: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al añadir al carrito: ");
             return ['success' => false, 'message' => 'Error al añadir al carrito'];
         }

[Survived] FunctionCallRemoval
Controllers/ProductController.php:72:13
             
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
-            error_log("Error al añadir al carrito: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error al añadir al carrito'];
         }

[Killed] FalseValue
Controllers/ProductController.php:73:13
             return ['success' => true, 'message' => 'Producto añadido al carrito'];
         } catch (\Exception $e) {
             error_log("Error al añadir al carrito: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al añadir al carrito'];
+            return ['success' => true, 'message' => 'Error al añadir al carrito'];
         }
     }
killedBy: Tests\Unit\Controllers\ProductControllerTest::manejo_error_al_agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::manejo_error_al_agregar_al_carrito
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:337

FAILURES!
Tests: 15, Assertions: 49, Failures: 1.

[Survived] FunctionCallRemoval
Controllers/ProductController.php:94:13
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener todos los productos: " . $e->getMessage());
+            
             return [];
         }

[Survived] Concat
Controllers/ProductController.php:94:13
             }
             return $products;
         } catch (\Exception $e) {
-            error_log("Error al obtener todos los productos: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al obtener todos los productos: ");
             return [];
         }

[Killed] PublicVisibility
Controllers/ProductController.php:99:5
         }
     }
 
-    public function getCartItems($userId) {
+    protected function getCartItems($userId)
         try {
             $query = "SELECT * FROM cart WHERE user_id = ?";
killedBy: Tests\Unit\Controllers\ProductControllerTest::obtener_items_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::obtener_items_carrito
Error: Call to protected method Controllers\ProductController::getCartItems() from scope Tests\Unit\Controllers\ProductControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:107

ERRORS!
Tests: 3, Assertions: 9, Errors: 1.

[Killed] MethodCallRemoval
Controllers/ProductController.php:103:13
         try {
             $query = "SELECT * FROM cart WHERE user_id = ?";
             $stmt = $this->conn->prepare($query);
-            $stmt->execute([$userId]);
+            
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
killedBy: Tests\Unit\Controllers\ProductControllerTest::obtener_items_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::obtener_items_carrito
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 12, Failures: 1.

[Survived] FunctionCallRemoval
Controllers/ProductController.php:106:13
             $stmt->execute([$userId]);
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener items del carrito: " . $e->getMessage());
+            
             return [];
         }

[Survived] ConcatOperandRemoval
Controllers/ProductController.php:106:13
             $stmt->execute([$userId]);
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener items del carrito: " . $e->getMessage());
+            error_log("Error al obtener items del carrito: ");
             return [];
         }

[Killed] PublicVisibility
Controllers/ProductController.php:111:5
         }
     }
 
-    public function updateCartQuantity($cartId, $quantity) {
+    protected function updateCartQuantity($cartId, $quantity)
         try {
             $query = "UPDATE cart SET quantity = ? WHERE id = ?";
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:115:13
         try {
             $query = "UPDATE cart SET quantity = ? WHERE id = ?";
             $stmt = $this->conn->prepare($query);
-            $stmt->execute([$quantity, $cartId]);
+            
             return ['success' => true, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] ArrayItemRemoval
Controllers/ProductController.php:115:13
         try {
             $query = "UPDATE cart SET quantity = ? WHERE id = ?";
             $stmt = $this->conn->prepare($query);
-            $stmt->execute([$quantity, $cartId]);
+            $stmt->execute([$cartId]);
             return ['success' => true, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] TrueValue
Controllers/ProductController.php:116:13
             $query = "UPDATE cart SET quantity = ? WHERE id = ?";
             $stmt = $this->conn->prepare($query);
             $stmt->execute([$quantity, $cartId]);
-            return ['success' => true, 'message' => '¡Cantidad actualizada!'];
+            return ['success' => false, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
             error_log("Error al actualizar cantidad: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\ProductControllerTest::actualizar_cantidad_carrito_exitoso
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::actualizar_cantidad_carrito_exitoso
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:129

FAILURES!
Tests: 4, Assertions: 13, Failures: 1.

[Killed] FunctionCallRemoval
Controllers/ProductController.php:118:13
             $stmt->execute([$quantity, $cartId]);
             return ['success' => true, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar cantidad: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error al actualizar cantidad'];
         }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/ProductController.php:118:13
             $stmt->execute([$quantity, $cartId]);
             return ['success' => true, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
-            error_log("Error al actualizar cantidad: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error al actualizar cantidad'];
         }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/ProductController.php:119:13
             return ['success' => true, 'message' => '¡Cantidad actualizada!'];
         } catch (\Exception $e) {
             error_log("Error al actualizar cantidad: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error al actualizar cantidad'];
+            return ['success' => true, 'message' => 'Error al actualizar cantidad'];
         }
     }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Controllers/ProductController.php:123:5
         }
     }
 
-    public function deleteCartItem($cartId) {
+    protected function deleteCartItem($cartId)
         try {
             $query = "DELETE FROM cart WHERE id = ?";
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Controllers/ProductController.php:127:13
         try {
             $query = "DELETE FROM cart WHERE id = ?";
             $stmt = $this->conn->prepare($query);
-            $stmt->execute([$cartId]);
+            
             return true;
         } catch (\Exception $e) {
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] TrueValue
Controllers/ProductController.php:128:13
             $query = "DELETE FROM cart WHERE id = ?";
             $stmt = $this->conn->prepare($query);
             $stmt->execute([$cartId]);
-            return true;
+            return false;
         } catch (\Exception $e) {
             error_log("Error al eliminar item: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\ProductControllerTest::eliminar_item_carrito_exitoso
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::eliminar_item_carrito_exitoso
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:149

FAILURES!
Tests: 5, Assertions: 17, Failures: 1.

[Killed] FunctionCallRemoval
Controllers/ProductController.php:130:13
             $stmt->execute([$cartId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar item: " . $e->getMessage());
+            
             return false;
         }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] ConcatOperandRemoval
Controllers/ProductController.php:130:13
             $stmt->execute([$cartId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar item: " . $e->getMessage());
+            error_log("Error al eliminar item: ");
             return false;
         }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] FalseValue
Controllers/ProductController.php:131:13
             return true;
         } catch (\Exception $e) {
             error_log("Error al eliminar item: " . $e->getMessage());
-            return false;
+            return true;
         }
     }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Controllers/ProductController.php:135:5
         }
     }
 
-    public function deleteAllCartItems($userId) {
+    protected function deleteAllCartItems($userId)
         try {
             $query = "DELETE FROM cart WHERE user_id = ?";
killedBy: Tests\Unit\Controllers\ProductControllerTest::eliminar_todos_items_carrito_exitoso
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::eliminar_todos_items_carrito_exitoso
Error: Call to protected method Controllers\ProductController::deleteAllCartItems() from scope Tests\Unit\Controllers\ProductControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:166

ERRORS!
Tests: 6, Assertions: 19, Errors: 1

[Killed] TrueValue
Controllers/ProductController.php:140:13
             $query = "DELETE FROM cart WHERE user_id = ?";
             $stmt = $this->conn->prepare($query);
             $stmt->execute([$userId]);
-            return true;
+            return false;
         } catch (\Exception $e) {
             error_log("Error al eliminar todos los items: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\ProductControllerTest::eliminar_todos_items_carrito_exitoso
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::eliminar_todos_items_carrito_exitoso
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:168

FAILURES!
Tests: 6, Assertions: 20, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/ProductController.php:142:13
             $stmt->execute([$userId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar todos los items: " . $e->getMessage());
+            error_log("Error al eliminar todos los items: ");
             return false;
         }

[Survived] ConcatOperandRemoval
Controllers/ProductController.php:142:13
             $stmt->execute([$userId]);
             return true;
         } catch (\Exception $e) {
-            error_log("Error al eliminar todos los items: " . $e->getMessage());
+            error_log($e->getMessage());
             return false;
         }

[Killed] FalseValue
Controllers/ProductController.php:143:13
             return true;
         } catch (\Exception $e) {
             error_log("Error al eliminar todos los items: " . $e->getMessage());
-            return false;
+            return true;
         }
     }
killedBy: Tests\Unit\Controllers\ProductControllerTest::manejo_error_al_eliminar_todos_items_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::manejo_error_al_eliminar_todos_items_carrito
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTest.php:317

FAILURES!
Tests: 14, Assertions: 47, Failures: 1.
