[Killed] PublicVisibility
Controllers/SearchController.php:11:5
         $this->conn = $conn;
     }
 
-    public function searchProducts($searchTerm) {
+    protected function searchProducts($searchTerm)
         try {
             $searchTerm = "%{$searchTerm}%";
killedBy: Tests\Unit\Controllers\SearchControllerTest::buscar_productos_devuelve_resultados
statusReason: 1) Tests\Unit\Controllers\SearchControllerTest::buscar_productos_devuelve_resultados
Error: Call to protected method Controllers\SearchController::searchProducts() from scope Tests\Unit\Controllers\SearchControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\SearchControllerTest.php:38

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] MethodCallRemoval
Controllers/SearchController.php:15:13
         try {
             $searchTerm = "%{$searchTerm}%";
             $stmt = $this->conn->prepare("SELECT * FROM products WHERE name LIKE ?");
-            $stmt->execute([$searchTerm]);
+            
             
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
statusReason: 1) Tests\Unit\Controllers\SearchControllerTest::test_search_products_con_parametro_vacio
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
Controllers/SearchController.php:19:13
             
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error en búsqueda: " . $e->getMessage());
+            error_log("Error en búsqueda: ");
             return [];
         }
statusReason: 1) Tests\Unit\Controllers\SearchControllerTest::test_search_products_maneja_error_y_logging
Failed asserting that '[11-Dec-2024 17:31:13 Europe/Berlin] Error en búsqueda: \r\n
' contains "Error en búsqueda: Error de prueba".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\SearchControllerTest.php:117

FAILURES!
Tests: 5, Assertions: 8, Failures:

[Killed] FunctionCallRemoval
Controllers/SearchController.php:19:13
             
             return $stmt->fetchAll(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error en búsqueda: " . $e->getMessage());
+            
             return [];
         }
statusReason: 1) Tests\Unit\Controllers\SearchControllerTest::test_search_products_maneja_error_y_logging
Failed asserting that '' contains "Error en búsqueda: Error de prueba".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\SearchControllerTest.php:117

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.
