[Killed] FunctionCall
Controllers/UserController.php:15:9
     }
 
     private function hashPassword($password) {
-        return password_hash($password, PASSWORD_BCRYPT, ['cost' => self::HASH_COST]);
+        password_hash($password, PASSWORD_BCRYPT, ['cost' => self::HASH_COST]);
+        return null;
     }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::verifica_hash_password_con_costo_correcto
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::verifica_hash_password_con_costo_correcto
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:232

FAILURES!
Tests: 12, Assertions: 22, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:15:9
     }
 
     private function hashPassword($password) {
-        return password_hash($password, PASSWORD_BCRYPT, ['cost' => self::HASH_COST]);
+        return password_hash($password, PASSWORD_BCRYPT, []);
     }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::verifica_hash_password_con_costo_correcto
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::verifica_hash_password_con_costo_correcto
Failed asserting that '$2y$10$XDgAfdc4CNZQgmDaK1V58OdWUiq2Rd4AE28Mj1sYl3KQMMfGnTQ7.' contains "$2y$12$".

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:233

FAILURES!
Tests: 12, Assertions: 23, Failures: 1.

[Killed] FunctionCall
Controllers/UserController.php:19:9
     }
 
     private function verifyPassword($password, $hashedPassword) {
-        return password_verify($password, $hashedPassword);
+        password_verify($password, $hashedPassword);
+        return null;
     }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:62

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Controllers/UserController.php:22:5
         return password_verify($password, $hashedPassword);
     }
 
-    public function registerUser($userData) {
+    protected function registerUser($userData)
         try {
             $user = new User();
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
Error: Call to protected method Controllers\UserController::registerUser() from scope Tests\Unit\Controllers\UserControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:31

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] MethodCallRemoval
Controllers/UserController.php:25:13
     public function registerUser($userData) {
         try {
             $user = new User();
-            $user->setName($userData['name']);
+            
             $user->setEmail($userData['email']);
             $user->setUserType($userData['user_type'] ?? 'user');

[Survived] MethodCallRemoval
Controllers/UserController.php:26:13
         try {
             $user = new User();
             $user->setName($userData['name']);
-            $user->setEmail($userData['email']);
+            
             $user->setUserType($userData['user_type'] ?? 'user');
 

[Survived] Coalesce
Controllers/UserController.php:27:13
             $user = new User();
             $user->setName($userData['name']);
             $user->setEmail($userData['email']);
-            $user->setUserType($userData['user_type'] ?? 'user');
+            $user->setUserType('user' ?? $userData['user_type']);
 
             // Verificar si el correo ya existe

[Survived] MethodCallRemoval
Controllers/UserController.php:27:13
             $user = new User();
             $user->setName($userData['name']);
             $user->setEmail($userData['email']);
-            $user->setUserType($userData['user_type'] ?? 'user');
+            
 
             // Verificar si el correo ya existe

[Survived] MethodCallRemoval
Controllers/UserController.php:31:13
 
             // Verificar si el correo ya existe
             $stmt = $this->conn->prepare("SELECT id FROM users WHERE email = ?");
-            $stmt->execute([$user->getEmail()]);
+            
             if($stmt->fetch()) {
                 return ['success' => false, 'message' => 'El correo ya está registrado'];

[Survived] ArrayItemRemoval
Controllers/UserController.php:31:13
 
             // Verificar si el correo ya existe
             $stmt = $this->conn->prepare("SELECT id FROM users WHERE email = ?");
-            $stmt->execute([$user->getEmail()]);
+            $stmt->execute([]);
             if($stmt->fetch()) {
                 return ['success' => false, 'message' => 'El correo ya está registrado'];

[Killed] FalseValue
Controllers/UserController.php:33:17
             $stmt = $this->conn->prepare("SELECT id FROM users WHERE email = ?");
             $stmt->execute([$user->getEmail()]);
             if($stmt->fetch()) {
-                return ['success' => false, 'message' => 'El correo ya está registrado'];
+                return ['success' => true, 'message' => 'El correo ya está registrado'];
             }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::registro_falla_con_email_existente
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::registro_falla_con_email_existente
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:117

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:33:17
             $stmt = $this->conn->prepare("SELECT id FROM users WHERE email = ?");
             $stmt->execute([$user->getEmail()]);
             if($stmt->fetch()) {
-                return ['success' => false, 'message' => 'El correo ya está registrado'];
+                return ['message' => 'El correo ya está registrado'];
             }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::registro_falla_con_email_existente
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::registro_falla_con_email_existente
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:117

ERRORS!
Tests: 5, Assertions: 9, Errors: 1.

[Killed] MethodCallRemoval
Controllers/UserController.php:42:13
                  VALUES (?, ?, ?, ?)"
             );
             
-            $stmt->execute([
-                $user->getName(),
-                $user->getEmail(),
-                $this->hashPassword($userData['password']),
-                $user->getUserType()
-            ]);
+            
             
             return ['success' => true, 'message' => 'Registro exitoso!'];
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::register_mantiene_tipo_usuario_por_defecto
Undefined array key 3

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:649

ERRORS!
Tests: 34, Assertions: 62, Errors: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:42:13
                  VALUES (?, ?, ?, ?)"
             );
             
-            $stmt->execute([
-                $user->getName(),
-                $user->getEmail(),
-                $this->hashPassword($userData['password']),
-                $user->getUserType()
-            ]);
+            $stmt->execute([$user->getEmail(), $this->hashPassword($userData['password']), $user->getUserType()]);
             
             return ['success' => true, 'message' => 'Registro exitoso!'];
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::register_mantiene_tipo_usuario_por_defecto
Undefined array key 3

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:649

ERRORS!
Tests: 34, Assertions: 62, Errors: 1.

[Killed] TrueValue
Controllers/UserController.php:49:13
                 $user->getUserType()
             ]);
             
-            return ['success' => true, 'message' => 'Registro exitoso!'];
+            return ['success' => false, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
             error_log("Error en registro: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
Failed asserting that false is identical to true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:37

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:49:13
                 $user->getUserType()
             ]);
             
-            return ['success' => true, 'message' => 'Registro exitoso!'];
+            return ['message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
             error_log("Error en registro: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_registrarse
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:37

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] Concat
Controllers/UserController.php:51:13
             
             return ['success' => true, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
-            error_log("Error en registro: " . $e->getMessage());
+            error_log($e->getMessage() . "Error en registro: ");
             return ['success' => false, 'message' => 'Error en el registro'];
         }

[Survived] ConcatOperandRemoval
Controllers/UserController.php:51:13
             
             return ['success' => true, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
-            error_log("Error en registro: " . $e->getMessage());
+            error_log($e->getMessage());
             return ['success' => false, 'message' => 'Error en el registro'];
         }

[Killed] FalseValue
Controllers/UserController.php:52:13
             return ['success' => true, 'message' => 'Registro exitoso!'];
         } catch (\Exception $e) {
             error_log("Error en registro: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error en el registro'];
+            return ['success' => true, 'message' => 'Error en el registro'];
         }
     }
killedBy: Tests\Unit\Controllers\UserControllerTest::manejo_error_en_registro
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::manejo_error_en_registro
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:135

FAILURES!
Tests: 6, Assertions: 12, Failures: 1.

[Killed] PublicVisibility
Controllers/UserController.php:56:5
         }
     }
 
-    public function loginUser($email, $password) {
+    protected function loginUser($email, $password)
         try {
             $stmt = $this->conn->prepare("SELECT * FROM users WHERE email = ?");
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
Error: Call to protected method Controllers\UserController::loginUser() from scope Tests\Unit\Controllers\UserControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:60

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] MethodCallRemoval
Controllers/UserController.php:59:13
     public function loginUser($email, $password) {
         try {
             $stmt = $this->conn->prepare("SELECT * FROM users WHERE email = ?");
-            $stmt->execute([$email]);
+            
             $user = $stmt->fetch(\PDO::FETCH_ASSOC);
 
killedBy: Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Error en el inicio de sesión'
+'Correo o contraseña incorrectos'

[Killed] ArrayItemRemoval
Controllers/UserController.php:59:13
     public function loginUser($email, $password) {
         try {
             $stmt = $this->conn->prepare("SELECT * FROM users WHERE email = ?");
-            $stmt->execute([$email]);
+            $stmt->execute([]);
             $user = $stmt->fetch(\PDO::FETCH_ASSOC);
 
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::login_falla_con_parametros_vacios
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Error en el inicio de sesión'
+'Correo o contraseña incorrectos'

[Killed] LogicalAnd
Controllers/UserController.php:62:13
             $stmt->execute([$email]);
             $user = $stmt->fetch(\PDO::FETCH_ASSOC);
 
-            if ($user && $this->verifyPassword($password, $user['password'])) {
+            if ($user || $this->verifyPassword($password, $user['password'])) {
                 $_SESSION['user_id'] = $user['id'];
                 $_SESSION['user_name'] = $user['name'];
killedBy: Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
Failed asserting that two strings are identical.
--- Expected
+++ Actual
@@ @@
-'Correo o contraseña incorrectos'
+'Error en el inicio de sesión'

[Killed] TrueValue
Controllers/UserController.php:67:17
                 $_SESSION['user_name'] = $user['name'];
                 $_SESSION['user_type'] = $user['user_type'];
                 $_SESSION['user_email'] = $user['email'];
-                return ['success' => true, 'user_type' => $user['user_type']];
+                return ['success' => false, 'user_type' => $user['user_type']];
             }
 
killedBy: Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::usuario_puede_iniciar_sesion
Failed asserting that false is true.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:62

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] FalseValue
Controllers/UserController.php:70:13
                 return ['success' => true, 'user_type' => $user['user_type']];
             }
 
-            return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
+            return ['success' => true, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
             error_log("Error en login: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
Failed asserting that true is identical to false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:77

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:70:13
                 return ['success' => true, 'user_type' => $user['user_type']];
             }
 
-            return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
+            return ['message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
             error_log("Error en login: " . $e->getMessage());
killedBy: Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::inicio_sesion_falla_con_credenciales_incorrectas
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:77

ERRORS!
Tests: 3, Assertions: 4, Errors: 1.

[Survived] Concat
Controllers/UserController.php:72:13
 
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
-            error_log("Error en login: " . $e->getMessage());
+            error_log($e->getMessage() . "Error en login: ");
             return ['success' => false, 'message' => 'Error en el inicio de sesión'];
         }

[Survived] ConcatOperandRemoval
Controllers/UserController.php:72:13
 
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
-            error_log("Error en login: " . $e->getMessage());
+            error_log("Error en login: ");
             return ['success' => false, 'message' => 'Error en el inicio de sesión'];
         }

[Killed] FalseValue
Controllers/UserController.php:73:13
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
             error_log("Error en login: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error en el inicio de sesión'];
+            return ['success' => true, 'message' => 'Error en el inicio de sesión'];
         }
     }
killedBy: Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
Failed asserting that true is false.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:149

FAILURES!
Tests: 7, Assertions: 14, Failures: 1.

[Killed] ArrayItemRemoval
Controllers/UserController.php:73:13
             return ['success' => false, 'message' => 'Correo o contraseña incorrectos'];
         } catch (\Exception $e) {
             error_log("Error en login: " . $e->getMessage());
-            return ['success' => false, 'message' => 'Error en el inicio de sesión'];
+            return ['message' => 'Error en el inicio de sesión'];
         }
     }
killedBy: Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::manejo_error_en_login
Undefined array key "success"

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:149

ERRORS!
Tests: 7, Assertions: 13, Errors: 1.

[Killed] PublicVisibility
Controllers/UserController.php:99:5
         }
     }
 
-    public function getUserById($userId) {
+    protected function getUserById($userId)
         try {
             $stmt = $this->conn->prepare("SELECT id, name, email, user_type FROM users WHERE id = ?");
killedBy: Tests\Unit\Controllers\UserControllerTest::puede_obtener_usuario_por_id
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::puede_obtener_usuario_por_id
Error: Call to protected method Controllers\UserController::getUserById() from scope Tests\Unit\Controllers\UserControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:95

ERRORS!
Tests: 4, Assertions: 6, Errors: 1.

[Killed] MethodCallRemoval
Controllers/UserController.php:102:13
     public function getUserById($userId) {
         try {
             $stmt = $this->conn->prepare("SELECT id, name, email, user_type FROM users WHERE id = ?");
-            $stmt->execute([$userId]);
+            
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::getUserById_falla_con_id_nulo
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 31, Assertions: 54, Failures: 1.

[Survived] ConcatOperandRemoval
Controllers/UserController.php:105:13
             $stmt->execute([$userId]);
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener usuario: " . $e->getMessage());
+            error_log("Error al obtener usuario: ");
             return null;
         }

[Survived] Concat
Controllers/UserController.php:105:13
             $stmt->execute([$userId]);
             return $stmt->fetch(\PDO::FETCH_ASSOC);
         } catch (\Exception $e) {
-            error_log("Error al obtener usuario: " . $e->getMessage());
+            error_log($e->getMessage() . "Error al obtener usuario: ");
             return null;
         }

[Killed] PublicVisibility
Controllers/UserController.php:111:5
     }
 
     // Alias para mantener compatibilidad
-    public function register($userData) {
+    protected function register($userData)
         return $this->registerUser($userData);
     }
killedBy: Tests\Unit\Controllers\UserControllerTest::verificar_alias_register
statusReason: 1) Tests\Unit\Controllers\UserControllerTest::verificar_alias_register
Error: Call to protected method Controllers\UserController::register() from scope Tests\Unit\Controllers\UserControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\UserControllerTest.php:195

ERRORS!
Tests: 10, Assertions: 18, Errors: 1.
