[Killed] IncrementInteger
Exceptions/DatabaseException.php:5:5
 namespace Exceptions;
 
 class DatabaseException extends \Exception {
-    public function __construct(string $message = "", int $code = 0, \Throwable $previous = null) {
+    public function __construct(string $message = "", int $code = 1, \Throwable $previous = null)
         parent::__construct($message, $code, $previous);
     }
killedBy: Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_sin_parametros
statusReason: 1) Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_sin_parametros
Failed asserting that 1 matches expected 0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Exceptions\DatabaseExceptionTest.php:32

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.

[Killed] DecrementInteger
Exceptions/DatabaseException.php:5:5
 namespace Exceptions;
 
 class DatabaseException extends \Exception {
-    public function __construct(string $message = "", int $code = 0, \Throwable $previous = null) {
+    public function __construct(string $message = "", int $code = -1, \Throwable $previous = null)
         parent::__construct($message, $code, $previous);
     }
killedBy: Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_sin_parametros
statusReason: 1) Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_sin_parametros
Failed asserting that -1 matches expected 0.

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Exceptions\DatabaseExceptionTest.php:32

FAILURES!
Tests: 2, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Exceptions/DatabaseException.php:6:9
 
 class DatabaseException extends \Exception {
     public function __construct(string $message = "", int $code = 0, \Throwable $previous = null) {
-        parent::__construct($message, $code, $previous);
+        
     }
 } 
killedBy: Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_con_parametros
statusReason: 1) Tests\Unit\Exceptions\DatabaseExceptionTest::puede_crear_excepcion_con_parametros
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Error de prueba'
+''
