[Killed] PublicVisibility
Models/Cart.php:14:5
 
     // Getters
     public function getId() { return $this->id; }
-    public function getUserId() { return $this->userId; }
+    protected function getUserId()
     public function getName() { return $this->name; }
     public function getPrice() { return $this->price; }
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Error: Call to protected method Models\Cart::getUserId() from scope Controllers\ProductController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:63
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTe

[Killed] PublicVisibility
Models/Cart.php:15:5
     // Getters
     public function getId() { return $this->id; }
     public function getUserId() { return $this->userId; }
-    public function getName() { return $this->name; }
+    protected function getName()
     public function getPrice() { return $this->price; }
     public function getQuantity() { return $this->quantity; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Cart.php:16:5
     public function getId() { return $this->id; }
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
-    public function getPrice() { return $this->price; }
+    protected function getPrice()
     public function getQuantity() { return $this->quantity; }
     public function getImage() { return $this->image; }
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Error: Call to protected method Models\Cart::getPrice() from scope Controllers\ProductController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:65
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTes

[Killed] PublicVisibility
Models/Cart.php:17:5
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
     public function getPrice() { return $this->price; }
-    public function getQuantity() { return $this->quantity; }
+    protected function getQuantity()
     public function getImage() { return $this->image; }
 
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Error: Call to protected method Models\Cart::getQuantity() from scope Controllers\ProductController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:66
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductController

[Killed] PublicVisibility
Models/Cart.php:18:5
     public function getName() { return $this->name; }
     public function getPrice() { return $this->price; }
     public function getQuantity() { return $this->quantity; }
-    public function getImage() { return $this->image; }
+    protected function getImage()
 
     // Setters
killedBy: Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
statusReason: 1) Tests\Unit\Controllers\ProductControllerTest::agregar_al_carrito
Error: Call to protected method Models\Cart::getImage() from scope Controllers\ProductController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\ProductController.php:67
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\ProductControllerTes

[Killed] PublicVisibility
Models/Cart.php:21:5
     public function getImage() { return $this->image; }
 
     // Setters
-    public function setUserId($userId) { $this->userId = $userId; }
+    protected function setUserId($userId)
     public function setName($name) { $this->name = $name; }
     public function setPrice($price) { $this->price = $price; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Cart.php:22:5
 
     // Setters
     public function setUserId($userId) { $this->userId = $userId; }
-    public function setName($name) { $this->name = $name; }
+    protected function setName($name)
     public function setPrice($price) { $this->price = $price; }
     public function setQuantity($quantity) { $this->quantity = $quantity; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Cart.php:23:5
     // Setters
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
-    public function setPrice($price) { $this->price = $price; }
+    protected function setPrice($price)
     public function setQuantity($quantity) { $this->quantity = $quantity; }
     public function setImage($image) { $this->image = $image; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Cart.php:24:5
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
     public function setPrice($price) { $this->price = $price; }
-    public function setQuantity($quantity) { $this->quantity = $quantity; }
+    protected function setQuantity($quantity)
     public function setImage($image) { $this->image = $image; }
 } 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Cart.php:25:5
     public function setName($name) { $this->name = $name; }
     public function setPrice($price) { $this->price = $price; }
     public function setQuantity($quantity) { $this->quantity = $quantity; }
-    public function setImage($image) { $this->image = $image; }
+    protected function setImage($image)
 } 
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ProductControllerMutationTest.php" not found
