[Killed] PublicVisibility
Models/Message.php:13:5
     private $message;
 
     // Getters
-    public function getId() { return $this->id; }
+    protected function getId()
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_id
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_id
Error: Call to protected method Models\Message::getId() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:28

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:16:5
     public function getId() { return $this->id; }
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
-    public function getEmail() { return $this->email; }
+    protected function getEmail()
     public function getNumber() { return $this->number; }
     public function getMessage() { return $this->message; }
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_email
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_email
Error: Call to protected method Models\Message::getEmail() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:52

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:17:5
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
     public function getEmail() { return $this->email; }
-    public function getNumber() { return $this->number; }
+    protected function getNumber()
     public function getMessage() { return $this->message; }
 
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_number
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_number
Error: Call to protected method Models\Message::getNumber() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:60

ERRORS!
Tests: 5, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:18:5
     public function getName() { return $this->name; }
     public function getEmail() { return $this->email; }
     public function getNumber() { return $this->number; }
-    public function getMessage() { return $this->message; }
+    protected function getMessage()
 
     // Setters
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_message
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_message
Error: Call to protected method Models\Message::getMessage() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:68

ERRORS!
Tests: 6, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:23:5
     // Setters
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
-    public function setEmail($email) { $this->email = $email; }
+    protected function setEmail($email)
     public function setNumber($number) { $this->number = $number; }
     public function setMessage($message) { $this->message = $message; }
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_email
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_email
Error: Call to protected method Models\Message::setEmail() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:51

ERRORS!
Tests: 4, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:24:5
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
     public function setEmail($email) { $this->email = $email; }
-    public function setNumber($number) { $this->number = $number; }
+    protected function setNumber($number)
     public function setMessage($message) { $this->message = $message; }
 
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_number
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_number
Error: Call to protected method Models\Message::setNumber() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:59

ERRORS!
Tests: 5, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:25:5
     public function setName($name) { $this->name = $name; }
     public function setEmail($email) { $this->email = $email; }
     public function setNumber($number) { $this->number = $number; }
-    public function setMessage($message) { $this->message = $message; }
+    protected function setMessage($message)
 
     public function exists($conn) {
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_message
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_message
Error: Call to protected method Models\Message::setMessage() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:67

ERRORS!
Tests: 6, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:27:5
     public function setNumber($number) { $this->number = $number; }
     public function setMessage($message) { $this->message = $message; }
 
-    public function exists($conn) {
+    protected function exists($conn)
         $sql = "SELECT id FROM message WHERE user_id = ? AND message = ?";
         $stmt = $conn->prepare($sql);
killedBy: Tests\Unit\Models\MessageTest::maneja_error_al_verificar_existencia
statusReason: 1) Tests\Unit\Models\MessageTest::maneja_error_al_verificar_existencia
Error: Call to protected method Models\Message::exists() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:128

ERRORS!
Tests: 9, Assertions: 12, Errors: 1.

[Killed] MethodCallRemoval
Models/Message.php:30:9
     public function exists($conn) {
         $sql = "SELECT id FROM message WHERE user_id = ? AND message = ?";
         $stmt = $conn->prepare($sql);
-        $stmt->execute([$this->userId, $this->message]);
+        
         return $stmt->rowCount() > 0;
     }
killedBy: Tests\Unit\Models\MessageTest::maneja_error_al_verificar_existencia
statusReason: 1) Tests\Unit\Models\MessageTest::maneja_error_al_verificar_existencia
Expectation failed for method name is "execute" when invoked 1 time(s).
Method was expected to be called 1 times, actually called 0 times.

FAILURES!
Tests: 9, Assertions: 15, Failures: 1.

[Survived] ArrayItemRemoval
Models/Message.php:30:9
     public function exists($conn) {
         $sql = "SELECT id FROM message WHERE user_id = ? AND message = ?";
         $stmt = $conn->prepare($sql);
-        $stmt->execute([$this->userId, $this->message]);
+        $stmt->execute([$this->message]);
         return $stmt->rowCount() > 0;
     }

[Killed] PublicVisibility
Models/Message.php:34:5
         return $stmt->rowCount() > 0;
     }
 
-    public function save($conn) {
+    protected function save($conn)
         $sql = "INSERT INTO message (user_id, name, email, number, message) VALUES (?, ?, ?, ?, ?)";
         $stmt = $conn->prepare($sql);
killedBy: Tests\Unit\Models\MessageTest::puede_guardar_mensaje
statusReason: 1) Tests\Unit\Models\MessageTest::puede_guardar_mensaje
Error: Call to protected method Models\Message::save() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:88

ERRORS!
Tests: 7, Assertions: 6, Errors: 1.

[Killed] PublicVisibility
Models/Message.php:46:5
         ]);
     }
 
-    public function setId($id) { $this->id = $id; }
+    protected function setId($id)
 } 
killedBy: Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_id
statusReason: 1) Tests\Unit\Models\MessageTest::puede_establecer_y_obtener_id
Error: Call to protected method Models\Message::setId() from scope Tests\Unit\Models\MessageTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\MessageTest.php:27

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
