[Killed] PublicVisibility
Models/Order.php:21:5
     public function getId() { return $this->id; }
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
-    public function getNumber() { return $this->number; }
+    protected function getNumber()
     public function getEmail() { return $this->email; }
     public function getMethod() { return $this->method; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getNumber() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:132
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:63

E

[Killed] PublicVisibility
Models/Order.php:22:5
     public function getUserId() { return $this->userId; }
     public function getName() { return $this->name; }
     public function getNumber() { return $this->number; }
-    public function getEmail() { return $this->email; }
+    protected function getEmail()
     public function getMethod() { return $this->method; }
     public function getAddress() { return $this->address; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getEmail() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:133
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:63

ER

[Killed] PublicVisibility
Models/Order.php:23:5
     public function getName() { return $this->name; }
     public function getNumber() { return $this->number; }
     public function getEmail() { return $this->email; }
-    public function getMethod() { return $this->method; }
+    protected function getMethod()
     public function getAddress() { return $this->address; }
     public function getTotalProducts() { return $this->totalProducts; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getMethod() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:134
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:63

E

[Killed] PublicVisibility
Models/Order.php:24:5
     public function getNumber() { return $this->number; }
     public function getEmail() { return $this->email; }
     public function getMethod() { return $this->method; }
-    public function getAddress() { return $this->address; }
+    protected function getAddress()
     public function getTotalProducts() { return $this->totalProducts; }
     public function getTotalPrice() { return $this->totalPrice; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getAddress() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:135
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:63

[Killed] PublicVisibility
Models/Order.php:25:5
     public function getEmail() { return $this->email; }
     public function getMethod() { return $this->method; }
     public function getAddress() { return $this->address; }
-    public function getTotalProducts() { return $this->totalProducts; }
+    protected function getTotalProducts()
     public function getTotalPrice() { return $this->totalPrice; }
     public function getPlacedOn() { return $this->placedOn; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getTotalProducts() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:136
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.ph

[Killed] PublicVisibility
Models/Order.php:26:5
     public function getMethod() { return $this->method; }
     public function getAddress() { return $this->address; }
     public function getTotalProducts() { return $this->totalProducts; }
-    public function getTotalPrice() { return $this->totalPrice; }
+    protected function getTotalPrice()
     public function getPlacedOn() { return $this->placedOn; }
     public function getPaymentStatus() { return $this->paymentStatus; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::getTotalPrice() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:137
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:6

[Killed] PublicVisibility
Models/Order.php:28:5
     public function getTotalProducts() { return $this->totalProducts; }
     public function getTotalPrice() { return $this->totalPrice; }
     public function getPlacedOn() { return $this->placedOn; }
-    public function getPaymentStatus() { return $this->paymentStatus; }
+    protected function getPaymentStatus()
 
     // Setters
killedBy: Tests\Unit\Controllers\AdminControllerTest::testUpdateOrderStatus
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testUpdateOrderStatus
Error: Call to protected method Models\Order::getPaymentStatus() from scope Controllers\AdminController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:322
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\AdminControll

[Killed] PublicVisibility
Models/Order.php:33:5
     // Setters
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
-    public function setNumber($number) { $this->number = $number; }
+    protected function setNumber($number)
     public function setEmail($email) { $this->email = $email; }
     public function setMethod($method) { $this->method = $method; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Order.php:34:5
     public function setUserId($userId) { $this->userId = $userId; }
     public function setName($name) { $this->name = $name; }
     public function setNumber($number) { $this->number = $number; }
-    public function setEmail($email) { $this->email = $email; }
+    protected function setEmail($email)
     public function setMethod($method) { $this->method = $method; }
     public function setAddress($address) { $this->address = $address; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Order.php:35:5
     public function setName($name) { $this->name = $name; }
     public function setNumber($number) { $this->number = $number; }
     public function setEmail($email) { $this->email = $email; }
-    public function setMethod($method) { $this->method = $method; }
+    protected function setMethod($method)
     public function setAddress($address) { $this->address = $address; }
     public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\OrderControllerMutationTest.php" not found

[Killed] PublicVisibility
Models/Order.php:36:5
     public function setNumber($number) { $this->number = $number; }
     public function setEmail($email) { $this->email = $email; }
     public function setMethod($method) { $this->method = $method; }
-    public function setAddress($address) { $this->address = $address; }
+    protected function setAddress($address)
     public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
     public function setTotalPrice($totalPrice) { $this->totalPrice = $totalPrice; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::setAddress() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:120
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:63

[Killed] PublicVisibility
Models/Order.php:37:5
     public function setEmail($email) { $this->email = $email; }
     public function setMethod($method) { $this->method = $method; }
     public function setAddress($address) { $this->address = $address; }
-    public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
+    protected function setTotalProducts($totalProducts)
     public function setTotalPrice($totalPrice) { $this->totalPrice = $totalPrice; }
     public function setPaymentStatus($status) { $this->paymentStatus = $status; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::setTotalProducts() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:121
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.ph

[Killed] PublicVisibility
Models/Order.php:38:5
     public function setMethod($method) { $this->method = $method; }
     public function setAddress($address) { $this->address = $address; }
     public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
-    public function setTotalPrice($totalPrice) { $this->totalPrice = $totalPrice; }
+    protected function setTotalPrice($totalPrice)
     public function setPaymentStatus($status) { $this->paymentStatus = $status; }
     public function setPlacedOn($placedOn) { $this->placedOn = $placedOn; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::crear_pedido
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::crear_pedido
Error: Call to protected method Models\Order::setTotalPrice() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:122
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:6

[Killed] PublicVisibility
Models/Order.php:39:5
     public function setAddress($address) { $this->address = $address; }
     public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
     public function setTotalPrice($totalPrice) { $this->totalPrice = $totalPrice; }
-    public function setPaymentStatus($status) { $this->paymentStatus = $status; }
+    protected function setPaymentStatus($status)
     public function setPlacedOn($placedOn) { $this->placedOn = $placedOn; }
 
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Error: Call to protected method Models\Order::setPaymentStatus() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:198
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderContro

[Killed] PublicVisibility
Models/Order.php:40:5
     public function setTotalProducts($totalProducts) { $this->totalProducts = $totalProducts; }
     public function setTotalPrice($totalPrice) { $this->totalPrice = $totalPrice; }
     public function setPaymentStatus($status) { $this->paymentStatus = $status; }
-    public function setPlacedOn($placedOn) { $this->placedOn = $placedOn; }
+    protected function setPlacedOn($placedOn)
 
     public function setId($id) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_pedidos_usuario
Error: Call to protected method Models\Order::setPlacedOn() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:199
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerT

[Killed] PublicVisibility
Models/Order.php:42:5
     public function setPaymentStatus($status) { $this->paymentStatus = $status; }
     public function setPlacedOn($placedOn) { $this->placedOn = $placedOn; }
 
-    public function setId($id) {
+    protected function setId($id)
         $this->id = $id;
         return $this;
killedBy: Tests\Unit\Controllers\AdminControllerTest::testGetDashboardData
statusReason: 1) Tests\Unit\Controllers\AdminControllerTest::testGetDashboardData
Error: Call to protected method Models\Order::setId() from scope Controllers\AdminController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:42
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:24
C:\Users\A

[Survived] This
Models/Order.php:44:9
 
     public function setId($id) {
         $this->id = $id;
-        return $this;
+        return null;
     }
 } 
