[Killed] PublicVisibility
Models/Product.php:12:5
 
     // Getters
     public function getId() { return $this->id; }
-    public function getName() { return $this->name; }
+    protected function getName()
     public function getPrice() { return $this->price; }
     public function getImage() { return $this->image; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
Error: Call to protected method Models\Product::getName() from scope Tests\Unit\Controllers\OrderControllerTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTest.php:251

ERRORS!
Tests: 8, Assertions: 28, Errors: 1.

[Killed] PublicVisibility
Models/Product.php:14:5
     public function getId() { return $this->id; }
     public function getName() { return $this->name; }
     public function getPrice() { return $this->price; }
-    public function getImage() { return $this->image; }
+    protected function getImage()
 
     // Setters
killedBy: Tests\Unit\Controllers\AdminControllerTest::testAddProductSuccessfully
statusReason: 1) Warning
No tests found in class "Tests\Mutation\AdminControllerMutationTest".

ERRORS!
Tests: 3, Assertions: 5, Errors: 1, Warnings: 1.

[Killed] PublicVisibility
Models/Product.php:17:5
     public function getImage() { return $this->image; }
 
     // Setters
-    public function setName($name) { $this->name = $name; }
+    protected function setName($name)
     public function setPrice($price) { $this->price = $price; }
     public function setImage($image) { $this->image = $image; }
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
Error: Call to protected method Models\Product::setName() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:215
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTes

[Killed] PublicVisibility
Models/Product.php:19:5
     // Setters
     public function setName($name) { $this->name = $name; }
     public function setPrice($price) { $this->price = $price; }
-    public function setImage($image) { $this->image = $image; }
+    protected function setImage($image)
 
     public function setId($id) {
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_productos
Error: Call to protected method Models\Product::setImage() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:217
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTe
