[Killed] PublicVisibility
Models/User.php:19:5
     public function getId() { return $this->id; }
     public function getName() { return $this->name; }
     public function getEmail() { return $this->email; }
-    public function getUserType() { return $this->userType; }
+    protected function getUserType()
 
     // Setters
killedBy: Tests\Unit\Models\UserTest::verifica_constructor_inicializa_user_type
statusReason: 1) Tests\Unit\Models\UserTest::verifica_constructor_inicializa_user_type
Error: Call to protected method Models\User::getUserType() from scope Tests\Unit\Models\UserTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\UserTest.php:26

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Models/User.php:24:5
     // Setters
     public function setName($name) { $this->name = $name; }
     public function setEmail($email) { $this->email = $email; }
-    public function setPassword($password) { 
+    protected function setPassword($password)
         $this->password = password_hash($password, PASSWORD_DEFAULT);
     }
killedBy: Tests\Unit\Models\UserTest::verifica_password_es_hasheado
statusReason: 1) Tests\Unit\Models\UserTest::verifica_password_es_hasheado
Error: Call to protected method Models\User::setPassword() from scope Tests\Unit\Models\UserTest

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Models\UserTest.php:33

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Models/User.php:27:5
     public function setPassword($password) { 
         $this->password = password_hash($password, PASSWORD_DEFAULT);
     }
-    public function setUserType($userType) { $this->userType = $userType; }
+    protected function setUserType($userType)
     public function setId($id) { 
         $this->id = $id; 
killedBy: Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
statusReason: 1) Tests\Unit\Controllers\OrderControllerTest::obtener_todos_usuarios
Error: Call to protected method Models\User::setUserType() from scope Controllers\OrderController

C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:236
C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Unit\Controllers\OrderControllerTes

[Killed] PublicVisibility
Models/User.php:28:5
         $this->password = password_hash($password, PASSWORD_DEFAULT);
     }
     public function setUserType($userType) { $this->userType = $userType; }
-    public function setId($id) { 
+    protected function setId($id)
         $this->id = $id; 
         return $this;
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] MethodCallRemoval
Models/User.php:35:9
 
     public function exists($conn) {
         $stmt = $conn->prepare("SELECT id FROM users WHERE id = ?");
-        $stmt->execute([$this->id]);
+        
         return $stmt->rowCount() > 0;
     }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] GreaterThan
Models/User.php:36:9
     public function exists($conn) {
         $stmt = $conn->prepare("SELECT id FROM users WHERE id = ?");
         $stmt->execute([$this->id]);
-        return $stmt->rowCount() > 0;
+        return $stmt->rowCount() >= 0;
     }
 }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found

[Killed] GreaterThanNegotiation
Models/User.php:36:9
     public function exists($conn) {
         $stmt = $conn->prepare("SELECT id FROM users WHERE id = ?");
         $stmt->execute([$this->id]);
-        return $stmt->rowCount() > 0;
+        return $stmt->rowCount() <= 0;
     }
 }
statusReason: Warning: Module "openssl" is already loaded in Unknown on line 0
PHPUnit 9.6.22 by Sebastian Bergmann and contributors.

Test file "C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\tests\Mutation\ContactControllerMutationTest.php" not found
