11) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:105    [M] Concat

--- Original
+++ New
@@ @@
     }
     private function handleDatabaseError($e)
     {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log($e->getMessage() . "Error en la base de datos: ");
         throw new \Exception("Error al procesar la solicitud");
     }
     public function addProduct($postData, $files)

12) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:105    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function handleDatabaseError($e)
     {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log($e->getMessage());
         throw new \Exception("Error al procesar la solicitud");
     }
     public function addProduct($postData, $files)

13) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:105    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     }
     private function handleDatabaseError($e)
     {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        error_log("Error en la base de datos: ");
         throw new \Exception("Error al procesar la solicitud");
     }
     public function addProduct($postData, $files)

14) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:105    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     }
     private function handleDatabaseError($e)
     {
-        error_log("Error en la base de datos: " . $e->getMessage());
+        
         throw new \Exception("Error al procesar la solicitud");
     }
     public function addProduct($postData, $files)

17) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:184    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             // Verificar que el archivo existe en la base de datos
             $stmt = $this->conn->prepare("SELECT image FROM products WHERE image = ?");
-            $stmt->execute([$imageName]);
+            $stmt->execute([]);
             if (!$stmt->fetch()) {
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }

19) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:189    [M] Concat

--- Original
+++ New
@@ @@
             if (!$stmt->fetch()) {
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }
-            return self::UPLOAD_PATH . $imageName;
+            return $imageName . self::UPLOAD_PATH;
         } catch (\Exception $e) {
             error_log("Error en getSecureImagePath: " . $e->getMessage());
             return false;

20) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:189    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!$stmt->fetch()) {
                 throw new \Exception('Archivo no encontrado en la base de datos');
             }
-            return self::UPLOAD_PATH . $imageName;
+            return $imageName;
         } catch (\Exception $e) {
             error_log("Error en getSecureImagePath: " . $e->getMessage());
             return false;

21) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:191    [M] Concat

--- Original
+++ New
@@ @@
             }
             return self::UPLOAD_PATH . $imageName;
         } catch (\Exception $e) {
-            error_log("Error en getSecureImagePath: " . $e->getMessage());
+            error_log($e->getMessage() . "Error en getSecureImagePath: ");
             return false;
         }
     }

24) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:191    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             }
             return self::UPLOAD_PATH . $imageName;
         } catch (\Exception $e) {
-            error_log("Error en getSecureImagePath: " . $e->getMessage());
+            
             return false;
         }
     }

47) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\AdminController.php:369    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $user = new User();
             $user->setId($userId);
             $stmt = $this->conn->prepare("DELETE FROM `users` WHERE id = ?");
-            return $stmt->execute([$user->getId()]);
+            return $stmt->execute([]);
         } catch (\PDOException $e) {
             $this->handleDatabaseError($e);
             return false;

79) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:108    [M] Multiplication

--- Original
+++ New
@@ @@
             $products = [];
             foreach ($cartItems as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += $item['price'] * $item['quantity'];
+                $cartTotal += $item['price'] / $item['quantity'];
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección

80) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:108    [M] Assignment

--- Original
+++ New
@@ @@
             $products = [];
             foreach ($cartItems as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += $item['price'] * $item['quantity'];
+                $cartTotal = $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección

81) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:108    [M] PlusEqual

--- Original
+++ New
@@ @@
             $products = [];
             foreach ($cartItems as $item) {
                 $products[] = $item['name'] . ' (' . $item['quantity'] . ')';
-                $cartTotal += $item['price'] * $item['quantity'];
+                $cartTotal -= $item['price'] * $item['quantity'];
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección

82) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = $userData['flat'] . 'flat no. ' . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

83) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

84) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

85) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . ', ' . $userData['flat'] . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

86) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

87) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . $userData['street'] . ', ' . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

88) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

89) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] Concat

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . ', ' . $userData['street'] . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

90) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:113    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             $totalProducts = implode(', ', $products);
             // Formatear y establecer dirección
-            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . ', ' . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
+            $address = 'flat no. ' . $userData['flat'] . ', ' . $userData['street'] . $userData['city'] . ', ' . $userData['country'] . ' - ' . $userData['pin_code'];
             // Establecer valores adicionales en el objeto Order
             $order->setAddress($address);
             $order->setTotalProducts($totalProducts);

108) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:167    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $this->clearCart($userId);
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
-            error_log("Error al crear orden: " . $e->getMessage());
+            error_log("Error al crear orden: ");
             return ['success' => false, 'message' => 'Error al procesar el pedido'];
         }
     }

109) C:\Users\ASUS\Desktop\proyecto-si784-2024-ii-u3-reportes_chambilla_llantay\src\Controllers\OrderController.php:167    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $this->clearCart($userId);
             return ['success' => true, 'message' => '¡Pedido realizado con éxito!'];
         } catch (\Exception $e) {
-            error_log("Error al crear orden: " . $e->getMessage());
+            
             return ['success' => false, 'message' => 'Error al procesar el pedido'];
         }
     }
